fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// hw_sysctl.h - Macros used when accessing the system control hardware.
//
// Copyright (c) 2005-2020 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision 2.2.0.295 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __HW_SYSCTL_H__
#define __HW_SYSCTL_H__

//*****************************************************************************
//
// The following are defines for the System Control register addresses.
//
//*****************************************************************************
#define SYSCTL_DID0    0x400FE000     // Device Identification 0
#define SYSCTL_DID1    0x400FE004     // Device Identification 1
#define SYSCTL_DC0     0x400FE008     // Device Capabilities 0
#define SYSCTL_DC1     0x400FE010     // Device Capabilities 1
#define SYSCTL_DC2     0x400FE014     // Device Capabilities 2
#define SYSCTL_DC3     0x400FE018     // Device Capabilities 3
#define SYSCTL_DC4     0x400FE01C     // Device Capabilities 4
#define SYSCTL_DC5     0x400FE020     // Device Capabilities 5
#define SYSCTL_DC6     0x400FE024     // Device Capabilities 6
#define SYSCTL_DC7     0x400FE028     // Device Capabilities 7
#define SYSCTL_DC8     0x400FE02C     // Device Capabilities 8
#define SYSCTL_PBORCTL 0x400FE030     // Brown-Out Reset Control
#define SYSCTL_PTBOCTL 0x400FE038     // Power-Temp Brown Out Control
#define SYSCTL_SRCR0   0x400FE040     // Software Reset Control 0
#define SYSCTL_SRCR1   0x400FE044     // Software Reset Control 1
#define SYSCTL_SRCR2   0x400FE048     // Software Reset Control 2
#define SYSCTL_RIS     0x400FE050     // Raw Interrupt Status
#define SYSCTL_IMC     0x400FE054     // Interrupt Mask Control
#define SYSCTL_MISC \
    0x400FE058                        // Masked Interrupt Status and
                                      // Clear
#define SYSCTL_RESC  0x400FE05C       // Reset Cause
#define SYSCTL_PWRTC 0x400FE060       // Power-Temperature Cause
#define SYSCTL_RCC   0x400FE060       // Run-Mode Clock Configuration
#define SYSCTL_NMIC  0x400FE064       // NMI Cause Register
#define SYSCTL_GPIOHBCTL \
    0x400FE06C                        // GPIO High-Performance Bus
                                      // Control
#define SYSCTL_RCC2    0x400FE070     // Run-Mode Clock Configuration 2
#define SYSCTL_MOSCCTL 0x400FE07C     // Main Oscillator Control
#define SYSCTL_RSCLKCFG \
    0x400FE0B0                        // Run and Sleep Mode Configuration
                                      // Register
#define SYSCTL_MEMTIM0 \
    0x400FE0C0                        // Memory Timing Parameter Register
                                      // 0 for Main Flash and EEPROM
#define SYSCTL_RCGC0 \
    0x400FE100                        // Run Mode Clock Gating Control
                                      // Register 0
#define SYSCTL_RCGC1 \
    0x400FE104                        // Run Mode Clock Gating Control
                                      // Register 1
#define SYSCTL_RCGC2 \
    0x400FE108                        // Run Mode Clock Gating Control
                                      // Register 2
#define SYSCTL_SCGC0 \
    0x400FE110                        // Sleep Mode Clock Gating Control
                                      // Register 0
#define SYSCTL_SCGC1 \
    0x400FE114                        // Sleep Mode Clock Gating Control
                                      // Register 1
#define SYSCTL_SCGC2 \
    0x400FE118                        // Sleep Mode Clock Gating Control
                                      // Register 2
#define SYSCTL_DCGC0 \
    0x400FE120                        // Deep Sleep Mode Clock Gating
                                      // Control Register 0
#define SYSCTL_DCGC1 \
    0x400FE124                        // Deep-Sleep Mode Clock Gating
                                      // Control Register 1
#define SYSCTL_DCGC2 \
    0x400FE128                        // Deep Sleep Mode Clock Gating
                                      // Control Register 2
#define SYSCTL_ALTCLKCFG  0x400FE138  // Alternate Clock Configuration
#define SYSCTL_DSLPCLKCFG 0x400FE144  // Deep Sleep Clock Configuration
#define SYSCTL_DSCLKCFG \
    0x400FE144                        // Deep Sleep Clock Configuration
                                      // Register
#define SYSCTL_DIVSCLK \
    0x400FE148                        // Divisor and Source Clock
                                      // Configuration
#define SYSCTL_SYSPROP 0x400FE14C     // System Properties
#define SYSCTL_PIOSCCAL \
    0x400FE150                        // Precision Internal Oscillator
                                      // Calibration
#define SYSCTL_PIOSCSTAT \
    0x400FE154                        // Precision Internal Oscillator
                                      // Statistics
#define SYSCTL_PLLFREQ0    0x400FE160 // PLL Frequency 0
#define SYSCTL_PLLFREQ1    0x400FE164 // PLL Frequency 1
#define SYSCTL_PLLSTAT     0x400FE168 // PLL Status
#define SYSCTL_SLPPWRCFG   0x400FE188 // Sleep Power Configuration
#define SYSCTL_DSLPPWRCFG  0x400FE18C // Deep-Sleep Power Configuration
#define SYSCTL_DC9         0x400FE190 // Device Capabilities 9
#define SYSCTL_NVMSTAT     0x400FE1A0 // Non-Volatile Memory Information
#define SYSCTL_LDOSPCTL    0x400FE1B4 // LDO Sleep Power Control
#define SYSCTL_LDODPCTL    0x400FE1BC // LDO Deep-Sleep Power Control
#define SYSCTL_RESBEHAVCTL 0x400FE1D8 // Reset Behavior Control Register
#define SYSCTL_HSSR        0x400FE1F4 // Hardware System Service Request
#define SYSCTL_USBPDS      0x400FE280 // USB Power Domain Status
#define SYSCTL_USBMPC      0x400FE284 // USB Memory Power Control
#define SYSCTL_EMACPDS     0x400FE288 // Ethernet MAC Power Domain Status
#define SYSCTL_EMACMPC \
    0x400FE28C                        // Ethernet MAC Memory Power
                                      // Control
#define SYSCTL_LCDMPC 0x400FE294      // LCD Memory Power Control
#define SYSCTL_PPWD \
    0x400FE300                        // Watchdog Timer Peripheral
                                      // Present
#define SYSCTL_PPTIMER \
    0x400FE304                        // 16/32-Bit General-Purpose Timer
                                      // Peripheral Present
#define SYSCTL_PPGPIO \
    0x400FE308                        // General-Purpose Input/Output
                                      // Peripheral Present
#define SYSCTL_PPDMA \
    0x400FE30C                        // Micro Direct Memory Access
                                      // Peripheral Present
#define SYSCTL_PPEPI 0x400FE310       // EPI Peripheral Present
#define SYSCTL_PPHIB 0x400FE314       // Hibernation Peripheral Present
#define SYSCTL_PPUART \
    0x400FE318                        // Universal Asynchronous
                                      // Receiver/Transmitter Peripheral
                                      // Present
#define SYSCTL_PPSSI \
    0x400FE31C                        // Synchronous Serial Interface
                                      // Peripheral Present
#define SYSCTL_PPI2C \
    0x400FE320                        // Inter-Integrated Circuit
                                      // Peripheral Present
#define SYSCTL_PPUSB \
    0x400FE328                        // Universal Serial Bus Peripheral
                                      // Present
#define SYSCTL_PPEPHY 0x400FE330      // Ethernet PHY Peripheral Present
#define SYSCTL_PPCAN \
    0x400FE334                        // Controller Area Network
                                      // Peripheral Present
#define SYSCTL_PPADC \
    0x400FE338                        // Analog-to-Digital Converter
                                      // Peripheral Present
#define SYSCTL_PPACMP \
    0x400FE33C                        // Analog Comparator Peripheral
                                      // Present
#define SYSCTL_PPPWM \
    0x400FE340                        // Pulse Width Modulator Peripheral
                                      // Present
#define SYSCTL_PPQEI \
    0x400FE344                        // Quadrature Encoder Interface
                                      // Peripheral Present
#define SYSCTL_PPLPC \
    0x400FE348                        // Low Pin Count Interface
                                      // Peripheral Present
#define SYSCTL_PPPECI \
    0x400FE350                        // Platform Environment Control
                                      // Interface Peripheral Present
#define SYSCTL_PPFAN    0x400FE354    // Fan Control Peripheral Present
#define SYSCTL_PPEEPROM 0x400FE358    // EEPROM Peripheral Present
#define SYSCTL_PPWTIMER \
    0x400FE35C                        // 32/64-Bit Wide General-Purpose
                                      // Timer Peripheral Present
#define SYSCTL_PPRTS \
    0x400FE370                        // Remote Temperature Sensor
                                      // Peripheral Present
#define SYSCTL_PPCCM \
    0x400FE374                        // CRC and Cryptographic Modules
                                      // Peripheral Present
#define SYSCTL_PPLCD   0x400FE390     // LCD Peripheral Present
#define SYSCTL_PPOWIRE 0x400FE398     // 1-Wire Peripheral Present
#define SYSCTL_PPEMAC  0x400FE39C     // Ethernet MAC Peripheral Present
#define SYSCTL_PPHIM \
    0x400FE3A4                        // Human Interface Master
                                      // Peripheral Present
#define SYSCTL_SRWD 0x400FE500        // Watchdog Timer Software Reset
#define SYSCTL_SRTIMER \
    0x400FE504                        // 16/32-Bit General-Purpose Timer
                                      // Software Reset
#define SYSCTL_SRGPIO \
    0x400FE508                        // General-Purpose Input/Output
                                      // Software Reset
#define SYSCTL_SRDMA \
    0x400FE50C                        // Micro Direct Memory Access
                                      // Software Reset
#define SYSCTL_SREPI 0x400FE510       // EPI Software Reset
#define SYSCTL_SRHIB 0x400FE514       // Hibernation Software Reset
#define SYSCTL_SRUART \
    0x400FE518                        // Universal Asynchronous
                                      // Receiver/Transmitter Software
                                      // Reset
#define SYSCTL_SRSSI \
    0x400FE51C                        // Synchronous Serial Interface
                                      // Software Reset
#define SYSCTL_SRI2C \
    0x400FE520                        // Inter-Integrated Circuit
                                      // Software Reset
#define SYSCTL_SRUSB \
    0x400FE528                        // Universal Serial Bus Software
                                      // Reset
#define SYSCTL_SREPHY 0x400FE530      // Ethernet PHY Software Reset
#define SYSCTL_SRCAN \
    0x400FE534                        // Controller Area Network Software
                                      // Reset
#define SYSCTL_SRADC \
    0x400FE538                        // Analog-to-Digital Converter
                                      // Software Reset
#define SYSCTL_SRACMP 0x400FE53C      // Analog Comparator Software Reset
#define SYSCTL_SRPWM \
    0x400FE540                        // Pulse Width Modulator Software
                                      // Reset
#define SYSCTL_SRQEI \
    0x400FE544                        // Quadrature Encoder Interface
                                      // Software Reset
#define SYSCTL_SREEPROM 0x400FE558    // EEPROM Software Reset
#define SYSCTL_SRWTIMER \
    0x400FE55C                        // 32/64-Bit Wide General-Purpose
                                      // Timer Software Reset
#define SYSCTL_SRCCM \
    0x400FE574                        // CRC and Cryptographic Modules
                                      // Software Reset
#define SYSCTL_SRLCD   0x400FE590     // LCD Controller Software Reset
#define SYSCTL_SROWIRE 0x400FE598     // 1-Wire Software Reset
#define SYSCTL_SREMAC  0x400FE59C     // Ethernet MAC Software Reset
#define SYSCTL_RCGCWD \
    0x400FE600                        // Watchdog Timer Run Mode Clock
                                      // Gating Control
#define SYSCTL_RCGCTIMER \
    0x400FE604                        // 16/32-Bit General-Purpose Timer
                                      // Run Mode Clock Gating Control
#define SYSCTL_RCGCGPIO \
    0x400FE608                        // General-Purpose Input/Output Run
                                      // Mode Clock Gating Control
#define SYSCTL_RCGCDMA \
    0x400FE60C                        // Micro Direct Memory Access Run
                                      // Mode Clock Gating Control
#define SYSCTL_RCGCEPI \
    0x400FE610                        // EPI Run Mode Clock Gating
                                      // Control
#define SYSCTL_RCGCHIB \
    0x400FE614                        // Hibernation Run Mode Clock
                                      // Gating Control
#define SYSCTL_RCGCUART \
    0x400FE618                        // Universal Asynchronous
                                      // Receiver/Transmitter Run Mode
                                      // Clock Gating Control
#define SYSCTL_RCGCSSI \
    0x400FE61C                        // Synchronous Serial Interface Run
                                      // Mode Clock Gating Control
#define SYSCTL_RCGCI2C \
    0x400FE620                        // Inter-Integrated Circuit Run
                                      // Mode Clock Gating Control
#define SYSCTL_RCGCUSB \
    0x400FE628                        // Universal Serial Bus Run Mode
                                      // Clock Gating Control
#define SYSCTL_RCGCEPHY \
    0x400FE630                        // Ethernet PHY Run Mode Clock
                                      // Gating Control
#define SYSCTL_RCGCCAN \
    0x400FE634                        // Controller Area Network Run Mode
                                      // Clock Gating Control
#define SYSCTL_RCGCADC \
    0x400FE638                        // Analog-to-Digital Converter Run
                                      // Mode Clock Gating Control
#define SYSCTL_RCGCACMP \
    0x400FE63C                        // Analog Comparator Run Mode Clock
                                      // Gating Control
#define SYSCTL_RCGCPWM \
    0x400FE640                        // Pulse Width Modulator Run Mode
                                      // Clock Gating Control
#define SYSCTL_RCGCQEI \
    0x400FE644                        // Quadrature Encoder Interface Run
                                      // Mode Clock Gating Control
#define SYSCTL_RCGCEEPROM \
    0x400FE658                        // EEPROM Run Mode Clock Gating
                                      // Control
#define SYSCTL_RCGCWTIMER \
    0x400FE65C                        // 32/64-Bit Wide General-Purpose
                                      // Timer Run Mode Clock Gating
                                      // Control
#define SYSCTL_RCGCCCM \
    0x400FE674                        // CRC and Cryptographic Modules
                                      // Run Mode Clock Gating Control
#define SYSCTL_RCGCLCD \
    0x400FE690                        // LCD Controller Run Mode Clock
                                      // Gating Control
#define SYSCTL_RCGCOWIRE \
    0x400FE698                        // 1-Wire Run Mode Clock Gating
                                      // Control
#define SYSCTL_RCGCEMAC \
    0x400FE69C                        // Ethernet MAC Run Mode Clock
                                      // Gating Control
#define SYSCTL_SCGCWD \
    0x400FE700                        // Watchdog Timer Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_SCGCTIMER \
    0x400FE704                        // 16/32-Bit General-Purpose Timer
                                      // Sleep Mode Clock Gating Control
#define SYSCTL_SCGCGPIO \
    0x400FE708                        // General-Purpose Input/Output
                                      // Sleep Mode Clock Gating Control
#define SYSCTL_SCGCDMA \
    0x400FE70C                        // Micro Direct Memory Access Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_SCGCEPI \
    0x400FE710                        // EPI Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_SCGCHIB \
    0x400FE714                        // Hibernation Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_SCGCUART \
    0x400FE718                        // Universal Asynchronous
                                      // Receiver/Transmitter Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_SCGCSSI \
    0x400FE71C                        // Synchronous Serial Interface
                                      // Sleep Mode Clock Gating Control
#define SYSCTL_SCGCI2C \
    0x400FE720                        // Inter-Integrated Circuit Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_SCGCUSB \
    0x400FE728                        // Universal Serial Bus Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_SCGCEPHY \
    0x400FE730                        // Ethernet PHY Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_SCGCCAN \
    0x400FE734                        // Controller Area Network Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_SCGCADC \
    0x400FE738                        // Analog-to-Digital Converter
                                      // Sleep Mode Clock Gating Control
#define SYSCTL_SCGCACMP \
    0x400FE73C                        // Analog Comparator Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_SCGCPWM \
    0x400FE740                        // Pulse Width Modulator Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_SCGCQEI \
    0x400FE744                        // Quadrature Encoder Interface
                                      // Sleep Mode Clock Gating Control
#define SYSCTL_SCGCEEPROM \
    0x400FE758                        // EEPROM Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_SCGCWTIMER \
    0x400FE75C                        // 32/64-Bit Wide General-Purpose
                                      // Timer Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_SCGCCCM \
    0x400FE774                        // CRC and Cryptographic Modules
                                      // Sleep Mode Clock Gating Control
#define SYSCTL_SCGCLCD \
    0x400FE790                        // LCD Controller Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_SCGCOWIRE \
    0x400FE798                        // 1-Wire Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_SCGCEMAC \
    0x400FE79C                        // Ethernet MAC Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_DCGCWD \
    0x400FE800                        // Watchdog Timer Deep-Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_DCGCTIMER \
    0x400FE804                        // 16/32-Bit General-Purpose Timer
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCGPIO \
    0x400FE808                        // General-Purpose Input/Output
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCDMA \
    0x400FE80C                        // Micro Direct Memory Access
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCEPI \
    0x400FE810                        // EPI Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCHIB \
    0x400FE814                        // Hibernation Deep-Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_DCGCUART \
    0x400FE818                        // Universal Asynchronous
                                      // Receiver/Transmitter Deep-Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_DCGCSSI \
    0x400FE81C                        // Synchronous Serial Interface
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCI2C \
    0x400FE820                        // Inter-Integrated Circuit
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCUSB \
    0x400FE828                        // Universal Serial Bus Deep-Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_DCGCEPHY \
    0x400FE830                        // Ethernet PHY Deep-Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_DCGCCAN \
    0x400FE834                        // Controller Area Network
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCADC \
    0x400FE838                        // Analog-to-Digital Converter
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCACMP \
    0x400FE83C                        // Analog Comparator Deep-Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_DCGCPWM \
    0x400FE840                        // Pulse Width Modulator Deep-Sleep
                                      // Mode Clock Gating Control
#define SYSCTL_DCGCQEI \
    0x400FE844                        // Quadrature Encoder Interface
                                      // Deep-Sleep Mode Clock Gating
