fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
                                      // Control
#define SYSCTL_DCGCEEPROM \
    0x400FE858                        // EEPROM Deep-Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_DCGCWTIMER \
    0x400FE85C                        // 32/64-Bit Wide General-Purpose
                                      // Timer Deep-Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_DCGCCCM \
    0x400FE874                        // CRC and Cryptographic Modules
                                      // Deep-Sleep Mode Clock Gating
                                      // Control
#define SYSCTL_DCGCLCD \
    0x400FE890                        // LCD Controller Deep-Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_DCGCOWIRE \
    0x400FE898                        // 1-Wire Deep-Sleep Mode Clock
                                      // Gating Control
#define SYSCTL_DCGCEMAC \
    0x400FE89C                        // Ethernet MAC Deep-Sleep Mode
                                      // Clock Gating Control
#define SYSCTL_PCWD 0x400FE900        // Watchdog Timer Power Control
#define SYSCTL_PCTIMER \
    0x400FE904                        // 16/32-Bit General-Purpose Timer
                                      // Power Control
#define SYSCTL_PCGPIO \
    0x400FE908                        // General-Purpose Input/Output
                                      // Power Control
#define SYSCTL_PCDMA \
    0x400FE90C                        // Micro Direct Memory Access Power
                                      // Control
#define SYSCTL_PCEPI \
    0x400FE910                        // External Peripheral Interface
                                      // Power Control
#define SYSCTL_PCHIB 0x400FE914       // Hibernation Power Control
#define SYSCTL_PCUART \
    0x400FE918                        // Universal Asynchronous
                                      // Receiver/Transmitter Power
                                      // Control
#define SYSCTL_PCSSI \
    0x400FE91C                        // Synchronous Serial Interface
                                      // Power Control
#define SYSCTL_PCI2C \
    0x400FE920                        // Inter-Integrated Circuit Power
                                      // Control
#define SYSCTL_PCUSB \
    0x400FE928                        // Universal Serial Bus Power
                                      // Control
#define SYSCTL_PCEPHY 0x400FE930      // Ethernet PHY Power Control
#define SYSCTL_PCCAN \
    0x400FE934                        // Controller Area Network Power
                                      // Control
#define SYSCTL_PCADC \
    0x400FE938                        // Analog-to-Digital Converter
                                      // Power Control
#define SYSCTL_PCACMP 0x400FE93C      // Analog Comparator Power Control
#define SYSCTL_PCPWM \
    0x400FE940                        // Pulse Width Modulator Power
                                      // Control
#define SYSCTL_PCQEI \
    0x400FE944                        // Quadrature Encoder Interface
                                      // Power Control
#define SYSCTL_PCEEPROM 0x400FE958    // EEPROM Power Control
#define SYSCTL_PCCCM \
    0x400FE974                        // CRC and Cryptographic Modules
                                      // Power Control
#define SYSCTL_PCLCD   0x400FE990     // LCD Controller Power Control
#define SYSCTL_PCOWIRE 0x400FE998     // 1-Wire Power Control
#define SYSCTL_PCEMAC  0x400FE99C     // Ethernet MAC Power Control
#define SYSCTL_PRWD    0x400FEA00     // Watchdog Timer Peripheral Ready
#define SYSCTL_PRTIMER \
    0x400FEA04                        // 16/32-Bit General-Purpose Timer
                                      // Peripheral Ready
#define SYSCTL_PRGPIO \
    0x400FEA08                        // General-Purpose Input/Output
                                      // Peripheral Ready
#define SYSCTL_PRDMA \
    0x400FEA0C                        // Micro Direct Memory Access
                                      // Peripheral Ready
#define SYSCTL_PREPI 0x400FEA10       // EPI Peripheral Ready
#define SYSCTL_PRHIB 0x400FEA14       // Hibernation Peripheral Ready
#define SYSCTL_PRUART \
    0x400FEA18                        // Universal Asynchronous
                                      // Receiver/Transmitter Peripheral
                                      // Ready
#define SYSCTL_PRSSI \
    0x400FEA1C                        // Synchronous Serial Interface
                                      // Peripheral Ready
#define SYSCTL_PRI2C \
    0x400FEA20                        // Inter-Integrated Circuit
                                      // Peripheral Ready
#define SYSCTL_PRUSB \
    0x400FEA28                        // Universal Serial Bus Peripheral
                                      // Ready
#define SYSCTL_PREPHY 0x400FEA30      // Ethernet PHY Peripheral Ready
#define SYSCTL_PRCAN \
    0x400FEA34                        // Controller Area Network
                                      // Peripheral Ready
#define SYSCTL_PRADC \
    0x400FEA38                        // Analog-to-Digital Converter
                                      // Peripheral Ready
#define SYSCTL_PRACMP \
    0x400FEA3C                        // Analog Comparator Peripheral
                                      // Ready
#define SYSCTL_PRPWM \
    0x400FEA40                        // Pulse Width Modulator Peripheral
                                      // Ready
#define SYSCTL_PRQEI \
    0x400FEA44                        // Quadrature Encoder Interface
                                      // Peripheral Ready
#define SYSCTL_PREEPROM 0x400FEA58    // EEPROM Peripheral Ready
#define SYSCTL_PRWTIMER \
    0x400FEA5C                        // 32/64-Bit Wide General-Purpose
                                      // Timer Peripheral Ready
#define SYSCTL_PRCCM \
    0x400FEA74                        // CRC and Cryptographic Modules
                                      // Peripheral Ready
#define SYSCTL_PRLCD     0x400FEA90   // LCD Controller Peripheral Ready
#define SYSCTL_PROWIRE   0x400FEA98   // 1-Wire Peripheral Ready
#define SYSCTL_PREMAC    0x400FEA9C   // Ethernet MAC Peripheral Ready
#define SYSCTL_UNIQUEID0 0x400FEF20   // Unique ID 0
#define SYSCTL_UNIQUEID1 0x400FEF24   // Unique ID 1
#define SYSCTL_UNIQUEID2 0x400FEF28   // Unique ID 2
#define SYSCTL_UNIQUEID3 0x400FEF2C   // Unique ID 3
#define SYSCTL_CCMCGREQ \
    0x44030204                        // Cryptographic Modules Clock
                                      // Gating Request

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DID0 register.
//
//*****************************************************************************
#define SYSCTL_DID0_VER_M 0x70000000    // DID0 Version
#define SYSCTL_DID0_VER_1 \
    0x10000000                          // Second version of the DID0
                                        // register format.
#define SYSCTL_DID0_CLASS_M 0x00FF0000  // Device Class
#define SYSCTL_DID0_CLASS_TM4C123 \
    0x00050000                          // Tiva TM4C123x and TM4E123x
                                        // microcontrollers
#define SYSCTL_DID0_CLASS_TM4C129 \
    0x000A0000                          // Tiva(TM) TM4C129-class
                                        // microcontrollers
#define SYSCTL_DID0_MAJ_M    0x0000FF00 // Major Revision
#define SYSCTL_DID0_MAJ_REVA 0x00000000 // Revision A (initial device)
#define SYSCTL_DID0_MAJ_REVB \
    0x00000100                          // Revision B (first base layer
                                        // revision)
#define SYSCTL_DID0_MAJ_REVC \
    0x00000200                          // Revision C (second base layer
                                        // revision)
#define SYSCTL_DID0_MIN_M 0x000000FF    // Minor Revision
#define SYSCTL_DID0_MIN_0 \
    0x00000000                          // Initial device, or a major
                                        // revision update
#define SYSCTL_DID0_MIN_1 0x00000001    // First metal layer change
#define SYSCTL_DID0_MIN_2 0x00000002    // Second metal layer change

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DID1 register.
//
//*****************************************************************************
#define SYSCTL_DID1_VER_M               0xF0000000 // DID1 Version
#define SYSCTL_DID1_VER_1               0x10000000 // fury_ib
#define SYSCTL_DID1_FAM_M               0x0F000000 // Family
#define SYSCTL_DID1_FAM_TIVA            0x00000000 // Tiva family of microcontollers
#define SYSCTL_DID1_PRTNO_M             0x00FF0000 // Part Number
#define SYSCTL_DID1_PRTNO_TM4C1230C3PM  0x00220000 // TM4C1230C3PM
#define SYSCTL_DID1_PRTNO_TM4C1230D5PM  0x00230000 // TM4C1230D5PM
#define SYSCTL_DID1_PRTNO_TM4C1230E6PM  0x00200000 // TM4C1230E6PM
#define SYSCTL_DID1_PRTNO_TM4C1230H6PM  0x00210000 // TM4C1230H6PM
#define SYSCTL_DID1_PRTNO_TM4C1231C3PM  0x00180000 // TM4C1231C3PM
#define SYSCTL_DID1_PRTNO_TM4C1231D5PM  0x00190000 // TM4C1231D5PM
#define SYSCTL_DID1_PRTNO_TM4C1231D5PZ  0x00360000 // TM4C1231D5PZ
#define SYSCTL_DID1_PRTNO_TM4C1231E6PM  0x00100000 // TM4C1231E6PM
#define SYSCTL_DID1_PRTNO_TM4C1231E6PZ  0x00300000 // TM4C1231E6PZ
#define SYSCTL_DID1_PRTNO_TM4C1231H6PGE 0x00350000 // TM4C1231H6PGE
#define SYSCTL_DID1_PRTNO_TM4C1231H6PM  0x00110000 // TM4C1231H6PM
#define SYSCTL_DID1_PRTNO_TM4C1231H6PZ  0x00310000 // TM4C1231H6PZ
#define SYSCTL_DID1_PRTNO_TM4C1232C3PM  0x00080000 // TM4C1232C3PM
#define SYSCTL_DID1_PRTNO_TM4C1232D5PM  0x00090000 // TM4C1232D5PM
#define SYSCTL_DID1_PRTNO_TM4C1232E6PM  0x000A0000 // TM4C1232E6PM
#define SYSCTL_DID1_PRTNO_TM4C1232H6PM  0x000B0000 // TM4C1232H6PM
#define SYSCTL_DID1_PRTNO_TM4C1233C3PM  0x00010000 // TM4C1233C3PM
#define SYSCTL_DID1_PRTNO_TM4C1233D5PM  0x00020000 // TM4C1233D5PM
#define SYSCTL_DID1_PRTNO_TM4C1233D5PZ  0x00D00000 // TM4C1233D5PZ
#define SYSCTL_DID1_PRTNO_TM4C1233E6PM  0x00030000 // TM4C1233E6PM
#define SYSCTL_DID1_PRTNO_TM4C1233E6PZ  0x00D10000 // TM4C1233E6PZ
#define SYSCTL_DID1_PRTNO_TM4C1233H6PGE 0x00D60000 // TM4C1233H6PGE
#define SYSCTL_DID1_PRTNO_TM4C1233H6PM  0x00040000 // TM4C1233H6PM
#define SYSCTL_DID1_PRTNO_TM4C1233H6PZ  0x00D20000 // TM4C1233H6PZ
#define SYSCTL_DID1_PRTNO_TM4C1236D5PM  0x00520000 // TM4C1236D5PM
#define SYSCTL_DID1_PRTNO_TM4C1236E6PM  0x00500000 // TM4C1236E6PM
#define SYSCTL_DID1_PRTNO_TM4C1236H6PM  0x00510000 // TM4C1236H6PM
#define SYSCTL_DID1_PRTNO_TM4C1237D5PM  0x00480000 // TM4C1237D5PM
#define SYSCTL_DID1_PRTNO_TM4C1237D5PZ  0x00660000 // TM4C1237D5PZ
#define SYSCTL_DID1_PRTNO_TM4C1237E6PM  0x00400000 // TM4C1237E6PM
#define SYSCTL_DID1_PRTNO_TM4C1237E6PZ  0x00600000 // TM4C1237E6PZ
#define SYSCTL_DID1_PRTNO_TM4C1237H6PGE 0x00650000 // TM4C1237H6PGE
#define SYSCTL_DID1_PRTNO_TM4C1237H6PM  0x00410000 // TM4C1237H6PM
#define SYSCTL_DID1_PRTNO_TM4C1237H6PZ  0x00610000 // TM4C1237H6PZ
#define SYSCTL_DID1_PRTNO_TM4C123AE6PM  0x00800000 // TM4C123AE6PM
#define SYSCTL_DID1_PRTNO_TM4C123AH6PM  0x00830000 // TM4C123AH6PM
#define SYSCTL_DID1_PRTNO_TM4C123BE6PM  0x00700000 // TM4C123BE6PM
#define SYSCTL_DID1_PRTNO_TM4C123BE6PZ  0x00C30000 // TM4C123BE6PZ
#define SYSCTL_DID1_PRTNO_TM4C123BH6PGE 0x00C60000 // TM4C123BH6PGE
#define SYSCTL_DID1_PRTNO_TM4C123BH6PM  0x00730000 // TM4C123BH6PM
#define SYSCTL_DID1_PRTNO_TM4C123BH6PZ  0x00C40000 // TM4C123BH6PZ
#define SYSCTL_DID1_PRTNO_TM4C123BH6ZRB 0x00E90000 // TM4C123BH6ZRB
#define SYSCTL_DID1_PRTNO_TM4C123FE6PM  0x00B00000 // TM4C123FE6PM
#define SYSCTL_DID1_PRTNO_TM4C123FH6PM  0x00B10000 // TM4C123FH6PM
#define SYSCTL_DID1_PRTNO_TM4C123GE6PM  0x00A00000 // TM4C123GE6PM
#define SYSCTL_DID1_PRTNO_TM4C123GE6PZ  0x00C00000 // TM4C123GE6PZ
#define SYSCTL_DID1_PRTNO_TM4C123GH6PGE 0x00C50000 // TM4C123GH6PGE
#define SYSCTL_DID1_PRTNO_TM4C123GH6PM  0x00A10000 // TM4C123GH6PM
#define SYSCTL_DID1_PRTNO_TM4C123GH6PZ  0x00C10000 // TM4C123GH6PZ
#define SYSCTL_DID1_PRTNO_TM4C123GH6ZRB 0x00E30000 // TM4C123GH6ZRB
#define SYSCTL_DID1_PRTNO_TM4C1290NCPDT 0x00190000 // TM4C1290NCPDT
#define SYSCTL_DID1_PRTNO_TM4C1290NCZAD 0x001B0000 // TM4C1290NCZAD
#define SYSCTL_DID1_PRTNO_TM4C1292NCPDT 0x001C0000 // TM4C1292NCPDT
#define SYSCTL_DID1_PRTNO_TM4C1292NCZAD 0x001E0000 // TM4C1292NCZAD
#define SYSCTL_DID1_PRTNO_TM4C1294KCPDT 0x00340000 // TM4C1294KCPDT
#define SYSCTL_DID1_PRTNO_TM4C1294NCPDT 0x001F0000 // TM4C1294NCPDT
#define SYSCTL_DID1_PRTNO_TM4C1294NCZAD 0x00210000 // TM4C1294NCZAD
#define SYSCTL_DID1_PRTNO_TM4C1297NCZAD 0x00220000 // TM4C1297NCZAD
#define SYSCTL_DID1_PRTNO_TM4C1299KCZAD 0x00360000 // TM4C1299KCZAD
#define SYSCTL_DID1_PRTNO_TM4C1299NCZAD 0x00230000 // TM4C1299NCZAD
#define SYSCTL_DID1_PRTNO_TM4C129CNCPDT 0x00240000 // TM4C129CNCPDT
#define SYSCTL_DID1_PRTNO_TM4C129CNCZAD 0x00260000 // TM4C129CNCZAD
#define SYSCTL_DID1_PRTNO_TM4C129DNCPDT 0x00270000 // TM4C129DNCPDT
#define SYSCTL_DID1_PRTNO_TM4C129DNCZAD 0x00290000 // TM4C129DNCZAD
#define SYSCTL_DID1_PRTNO_TM4C129EKCPDT 0x00350000 // TM4C129EKCPDT
#define SYSCTL_DID1_PRTNO_TM4C129ENCPDT 0x002D0000 // TM4C129ENCPDT
#define SYSCTL_DID1_PRTNO_TM4C129ENCZAD 0x002F0000 // TM4C129ENCZAD
#define SYSCTL_DID1_PRTNO_TM4C129LNCZAD 0x00300000 // TM4C129LNCZAD
#define SYSCTL_DID1_PRTNO_TM4C129XKCZAD 0x00370000 // TM4C129XKCZAD
#define SYSCTL_DID1_PRTNO_TM4C129XNCZAD 0x00320000 // TM4C129XNCZAD
#define SYSCTL_DID1_PINCNT_M            0x0000E000 // Package Pin Count
#define SYSCTL_DID1_PINCNT_100          0x00004000 // 100-pin LQFP package
#define SYSCTL_DID1_PINCNT_64           0x00006000 // 64-pin LQFP package
#define SYSCTL_DID1_PINCNT_144          0x00008000 // 144-pin LQFP package
#define SYSCTL_DID1_PINCNT_157          0x0000A000 // 157-pin BGA package
#define SYSCTL_DID1_PINCNT_128          0x0000C000 // 128-pin TQFP package
#define SYSCTL_DID1_TEMP_M              0x000000E0 // Temperature Range
#define SYSCTL_DID1_TEMP_C              0x00000000 // Commercial temperature range
#define SYSCTL_DID1_TEMP_I              0x00000020 // Industrial temperature range
#define SYSCTL_DID1_TEMP_E              0x00000040 // Extended temperature range
#define SYSCTL_DID1_TEMP_IE \
    0x00000060                                     // Available in both industrial
                                                   // temperature range (-40C to 85C)
                                                   // and extended temperature range
                                                   // (-40C to 105C) devices. See
#define SYSCTL_DID1_PKG_M   0x00000018             // Package Type
#define SYSCTL_DID1_PKG_QFP 0x00000008             // QFP package
#define SYSCTL_DID1_PKG_BGA 0x00000010             // BGA package
#define SYSCTL_DID1_ROHS    0x00000004             // RoHS-Compliance
#define SYSCTL_DID1_QUAL_M  0x00000003             // Qualification Status
#define SYSCTL_DID1_QUAL_ES 0x00000000             // Engineering Sample (unqualified)
#define SYSCTL_DID1_QUAL_PP 0x00000001             // Pilot Production (unqualified)
#define SYSCTL_DID1_QUAL_FQ 0x00000002             // Fully Qualified

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC0 register.
//
//*****************************************************************************
#define SYSCTL_DC0_SRAMSZ_M     0xFFFF0000 // SRAM Size
#define SYSCTL_DC0_SRAMSZ_2KB   0x00070000 // 2 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_4KB   0x000F0000 // 4 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_6KB   0x00170000 // 6 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_8KB   0x001F0000 // 8 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_12KB  0x002F0000 // 12 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_16KB  0x003F0000 // 16 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_20KB  0x004F0000 // 20 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_24KB  0x005F0000 // 24 KB of SRAM
#define SYSCTL_DC0_SRAMSZ_32KB  0x007F0000 // 32 KB of SRAM
#define SYSCTL_DC0_FLASHSZ_M    0x0000FFFF // Flash Size
#define SYSCTL_DC0_FLASHSZ_8KB  0x00000003 // 8 KB of Flash
#define SYSCTL_DC0_FLASHSZ_16KB 0x00000007 // 16 KB of Flash
#define SYSCTL_DC0_FLASHSZ_32KB 0x0000000F // 32 KB of Flash
#define SYSCTL_DC0_FLASHSZ_64KB 0x0000001F // 64 KB of Flash
#define SYSCTL_DC0_FLASHSZ_96KB 0x0000002F // 96 KB of Flash
#define SYSCTL_DC0_FLASHSZ_128K 0x0000003F // 128 KB of Flash
#define SYSCTL_DC0_FLASHSZ_192K 0x0000005F // 192 KB of Flash
#define SYSCTL_DC0_FLASHSZ_256K 0x0000007F // 256 KB of Flash

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC1 register.
//
//*****************************************************************************
#define SYSCTL_DC1_WDT1        0x10000000  // Watchdog Timer1 Present
#define SYSCTL_DC1_CAN1        0x02000000  // CAN Module 1 Present
#define SYSCTL_DC1_CAN0        0x01000000  // CAN Module 0 Present
#define SYSCTL_DC1_PWM1        0x00200000  // PWM Module 1 Present
#define SYSCTL_DC1_PWM0        0x00100000  // PWM Module 0 Present
#define SYSCTL_DC1_ADC1        0x00020000  // ADC Module 1 Present
#define SYSCTL_DC1_ADC0        0x00010000  // ADC Module 0 Present
#define SYSCTL_DC1_MINSYSDIV_M 0x0000F000  // System Clock Divider
#define SYSCTL_DC1_MINSYSDIV_80 \
    0x00002000                             // Specifies an 80-MHz CPU clock
                                           // with a PLL divider of 2.5
#define SYSCTL_DC1_MINSYSDIV_50 \
    0x00003000                             // Specifies a 50-MHz CPU clock
                                           // with a PLL divider of 4
#define SYSCTL_DC1_MINSYSDIV_40 \
    0x00004000                             // Specifies a 40-MHz CPU clock
                                           // with a PLL divider of 5
#define SYSCTL_DC1_MINSYSDIV_25 \
    0x00007000                             // Specifies a 25-MHz clock with a
                                           // PLL divider of 8
#define SYSCTL_DC1_MINSYSDIV_20 \
    0x00009000                             // Specifies a 20-MHz clock with a
                                           // PLL divider of 10
#define SYSCTL_DC1_ADC1SPD_M    0x00000C00 // Max ADC1 Speed
#define SYSCTL_DC1_ADC1SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_DC1_ADC1SPD_250K 0x00000400 // 250K samples/second
#define SYSCTL_DC1_ADC1SPD_500K 0x00000800 // 500K samples/second
#define SYSCTL_DC1_ADC1SPD_1M   0x00000C00 // 1M samples/second
#define SYSCTL_DC1_ADC0SPD_M    0x00000300 // Max ADC0 Speed
#define SYSCTL_DC1_ADC0SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_DC1_ADC0SPD_250K 0x00000100 // 250K samples/second
#define SYSCTL_DC1_ADC0SPD_500K 0x00000200 // 500K samples/second
#define SYSCTL_DC1_ADC0SPD_1M   0x00000300 // 1M samples/second
#define SYSCTL_DC1_MPU          0x00000080 // MPU Present
#define SYSCTL_DC1_HIB          0x00000040 // Hibernation Module Present
#define SYSCTL_DC1_TEMP         0x00000020 // Temp Sensor Present
#define SYSCTL_DC1_PLL          0x00000010 // PLL Present
#define SYSCTL_DC1_WDT0         0x00000008 // Watchdog Timer 0 Present
#define SYSCTL_DC1_SWO          0x00000004 // SWO Trace Port Present
#define SYSCTL_DC1_SWD          0x00000002 // SWD Present
#define SYSCTL_DC1_JTAG         0x00000001 // JTAG Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC2 register.
//
//*****************************************************************************
#define SYSCTL_DC2_EPI0   0x40000000 // EPI Module 0 Present
#define SYSCTL_DC2_I2S0   0x10000000 // I2S Module 0 Present
#define SYSCTL_DC2_COMP2  0x04000000 // Analog Comparator 2 Present
#define SYSCTL_DC2_COMP1  0x02000000 // Analog Comparator 1 Present
#define SYSCTL_DC2_COMP0  0x01000000 // Analog Comparator 0 Present
#define SYSCTL_DC2_TIMER3 0x00080000 // Timer Module 3 Present
#define SYSCTL_DC2_TIMER2 0x00040000 // Timer Module 2 Present
#define SYSCTL_DC2_TIMER1 0x00020000 // Timer Module 1 Present
#define SYSCTL_DC2_TIMER0 0x00010000 // Timer Module 0 Present
#define SYSCTL_DC2_I2C1HS 0x00008000 // I2C Module 1 Speed
#define SYSCTL_DC2_I2C1   0x00004000 // I2C Module 1 Present
#define SYSCTL_DC2_I2C0HS 0x00002000 // I2C Module 0 Speed
#define SYSCTL_DC2_I2C0   0x00001000 // I2C Module 0 Present
#define SYSCTL_DC2_QEI1   0x00000200 // QEI Module 1 Present
#define SYSCTL_DC2_QEI0   0x00000100 // QEI Module 0 Present
#define SYSCTL_DC2_SSI1   0x00000020 // SSI Module 1 Present
#define SYSCTL_DC2_SSI0   0x00000010 // SSI Module 0 Present
#define SYSCTL_DC2_UART2  0x00000004 // UART Module 2 Present
#define SYSCTL_DC2_UART1  0x00000002 // UART Module 1 Present
#define SYSCTL_DC2_UART0  0x00000001 // UART Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC3 register.
//
//*****************************************************************************
#define SYSCTL_DC3_32KHZ    0x80000000 // 32KHz Input Clock Available
#define SYSCTL_DC3_CCP5     0x20000000 // T2CCP1 Pin Present
#define SYSCTL_DC3_CCP4     0x10000000 // T2CCP0 Pin Present
#define SYSCTL_DC3_CCP3     0x08000000 // T1CCP1 Pin Present
#define SYSCTL_DC3_CCP2     0x04000000 // T1CCP0 Pin Present
#define SYSCTL_DC3_CCP1     0x02000000 // T0CCP1 Pin Present
#define SYSCTL_DC3_CCP0     0x01000000 // T0CCP0 Pin Present
#define SYSCTL_DC3_ADC0AIN7 0x00800000 // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC3_ADC0AIN6 0x00400000 // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC3_ADC0AIN5 0x00200000 // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC3_ADC0AIN4 0x00100000 // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC3_ADC0AIN3 0x00080000 // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC3_ADC0AIN2 0x00040000 // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC3_ADC0AIN1 0x00020000 // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC3_ADC0AIN0 0x00010000 // ADC Module 0 AIN0 Pin Present
#define SYSCTL_DC3_PWMFAULT 0x00008000 // PWM Fault Pin Present
#define SYSCTL_DC3_C2O      0x00004000 // C2o Pin Present
#define SYSCTL_DC3_C2PLUS   0x00002000 // C2+ Pin Present
#define SYSCTL_DC3_C2MINUS  0x00001000 // C2- Pin Present
#define SYSCTL_DC3_C1O      0x00000800 // C1o Pin Present
#define SYSCTL_DC3_C1PLUS   0x00000400 // C1+ Pin Present
#define SYSCTL_DC3_C1MINUS  0x00000200 // C1- Pin Present
#define SYSCTL_DC3_C0O      0x00000100 // C0o Pin Present
#define SYSCTL_DC3_C0PLUS   0x00000080 // C0+ Pin Present
#define SYSCTL_DC3_C0MINUS  0x00000040 // C0- Pin Present
#define SYSCTL_DC3_PWM5     0x00000020 // PWM5 Pin Present
#define SYSCTL_DC3_PWM4     0x00000010 // PWM4 Pin Present
#define SYSCTL_DC3_PWM3     0x00000008 // PWM3 Pin Present
#define SYSCTL_DC3_PWM2     0x00000004 // PWM2 Pin Present
#define SYSCTL_DC3_PWM1     0x00000002 // PWM1 Pin Present
#define SYSCTL_DC3_PWM0     0x00000001 // PWM0 Pin Present

