fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC4 register.
//
//*****************************************************************************
#define SYSCTL_DC4_EPHY0 0x40000000 // Ethernet PHY Layer 0 Present
#define SYSCTL_DC4_EMAC0 0x10000000 // Ethernet MAC Layer 0 Present
#define SYSCTL_DC4_E1588 0x01000000 // 1588 Capable
#define SYSCTL_DC4_PICAL 0x00040000 // PIOSC Calibrate
#define SYSCTL_DC4_CCP7  0x00008000 // T3CCP1 Pin Present
#define SYSCTL_DC4_CCP6  0x00004000 // T3CCP0 Pin Present
#define SYSCTL_DC4_UDMA  0x00002000 // Micro-DMA Module Present
#define SYSCTL_DC4_ROM   0x00001000 // Internal Code ROM Present
#define SYSCTL_DC4_GPIOJ 0x00000100 // GPIO Port J Present
#define SYSCTL_DC4_GPIOH 0x00000080 // GPIO Port H Present
#define SYSCTL_DC4_GPIOG 0x00000040 // GPIO Port G Present
#define SYSCTL_DC4_GPIOF 0x00000020 // GPIO Port F Present
#define SYSCTL_DC4_GPIOE 0x00000010 // GPIO Port E Present
#define SYSCTL_DC4_GPIOD 0x00000008 // GPIO Port D Present
#define SYSCTL_DC4_GPIOC 0x00000004 // GPIO Port C Present
#define SYSCTL_DC4_GPIOB 0x00000002 // GPIO Port B Present
#define SYSCTL_DC4_GPIOA 0x00000001 // GPIO Port A Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC5 register.
//
//*****************************************************************************
#define SYSCTL_DC5_PWMFAULT3 0x08000000 // PWM Fault 3 Pin Present
#define SYSCTL_DC5_PWMFAULT2 0x04000000 // PWM Fault 2 Pin Present
#define SYSCTL_DC5_PWMFAULT1 0x02000000 // PWM Fault 1 Pin Present
#define SYSCTL_DC5_PWMFAULT0 0x01000000 // PWM Fault 0 Pin Present
#define SYSCTL_DC5_PWMEFLT   0x00200000 // PWM Extended Fault Active
#define SYSCTL_DC5_PWMESYNC  0x00100000 // PWM Extended SYNC Active
#define SYSCTL_DC5_PWM7      0x00000080 // PWM7 Pin Present
#define SYSCTL_DC5_PWM6      0x00000040 // PWM6 Pin Present
#define SYSCTL_DC5_PWM5      0x00000020 // PWM5 Pin Present
#define SYSCTL_DC5_PWM4      0x00000010 // PWM4 Pin Present
#define SYSCTL_DC5_PWM3      0x00000008 // PWM3 Pin Present
#define SYSCTL_DC5_PWM2      0x00000004 // PWM2 Pin Present
#define SYSCTL_DC5_PWM1      0x00000002 // PWM1 Pin Present
#define SYSCTL_DC5_PWM0      0x00000001 // PWM0 Pin Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC6 register.
//
//*****************************************************************************
#define SYSCTL_DC6_USB0PHY      0x00000010 // USB Module 0 PHY Present
#define SYSCTL_DC6_USB0_M       0x00000003 // USB Module 0 Present
#define SYSCTL_DC6_USB0_DEV     0x00000001 // USB0 is Device Only
#define SYSCTL_DC6_USB0_HOSTDEV 0x00000002 // USB is Device or Host
#define SYSCTL_DC6_USB0_OTG     0x00000003 // USB0 is OTG

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC7 register.
//
//*****************************************************************************
#define SYSCTL_DC7_DMACH30 0x40000000 // DMA Channel 30
#define SYSCTL_DC7_DMACH29 0x20000000 // DMA Channel 29
#define SYSCTL_DC7_DMACH28 0x10000000 // DMA Channel 28
#define SYSCTL_DC7_DMACH27 0x08000000 // DMA Channel 27
#define SYSCTL_DC7_DMACH26 0x04000000 // DMA Channel 26
#define SYSCTL_DC7_DMACH25 0x02000000 // DMA Channel 25
#define SYSCTL_DC7_DMACH24 0x01000000 // DMA Channel 24
#define SYSCTL_DC7_DMACH23 0x00800000 // DMA Channel 23
#define SYSCTL_DC7_DMACH22 0x00400000 // DMA Channel 22
#define SYSCTL_DC7_DMACH21 0x00200000 // DMA Channel 21
#define SYSCTL_DC7_DMACH20 0x00100000 // DMA Channel 20
#define SYSCTL_DC7_DMACH19 0x00080000 // DMA Channel 19
#define SYSCTL_DC7_DMACH18 0x00040000 // DMA Channel 18
#define SYSCTL_DC7_DMACH17 0x00020000 // DMA Channel 17
#define SYSCTL_DC7_DMACH16 0x00010000 // DMA Channel 16
#define SYSCTL_DC7_DMACH15 0x00008000 // DMA Channel 15
#define SYSCTL_DC7_DMACH14 0x00004000 // DMA Channel 14
#define SYSCTL_DC7_DMACH13 0x00002000 // DMA Channel 13
#define SYSCTL_DC7_DMACH12 0x00001000 // DMA Channel 12
#define SYSCTL_DC7_DMACH11 0x00000800 // DMA Channel 11
#define SYSCTL_DC7_DMACH10 0x00000400 // DMA Channel 10
#define SYSCTL_DC7_DMACH9  0x00000200 // DMA Channel 9
#define SYSCTL_DC7_DMACH8  0x00000100 // DMA Channel 8
#define SYSCTL_DC7_DMACH7  0x00000080 // DMA Channel 7
#define SYSCTL_DC7_DMACH6  0x00000040 // DMA Channel 6
#define SYSCTL_DC7_DMACH5  0x00000020 // DMA Channel 5
#define SYSCTL_DC7_DMACH4  0x00000010 // DMA Channel 4
#define SYSCTL_DC7_DMACH3  0x00000008 // DMA Channel 3
#define SYSCTL_DC7_DMACH2  0x00000004 // DMA Channel 2
#define SYSCTL_DC7_DMACH1  0x00000002 // DMA Channel 1
#define SYSCTL_DC7_DMACH0  0x00000001 // DMA Channel 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC8 register.
//
//*****************************************************************************
#define SYSCTL_DC8_ADC1AIN15 0x80000000 // ADC Module 1 AIN15 Pin Present
#define SYSCTL_DC8_ADC1AIN14 0x40000000 // ADC Module 1 AIN14 Pin Present
#define SYSCTL_DC8_ADC1AIN13 0x20000000 // ADC Module 1 AIN13 Pin Present
#define SYSCTL_DC8_ADC1AIN12 0x10000000 // ADC Module 1 AIN12 Pin Present
#define SYSCTL_DC8_ADC1AIN11 0x08000000 // ADC Module 1 AIN11 Pin Present
#define SYSCTL_DC8_ADC1AIN10 0x04000000 // ADC Module 1 AIN10 Pin Present
#define SYSCTL_DC8_ADC1AIN9  0x02000000 // ADC Module 1 AIN9 Pin Present
#define SYSCTL_DC8_ADC1AIN8  0x01000000 // ADC Module 1 AIN8 Pin Present
#define SYSCTL_DC8_ADC1AIN7  0x00800000 // ADC Module 1 AIN7 Pin Present
#define SYSCTL_DC8_ADC1AIN6  0x00400000 // ADC Module 1 AIN6 Pin Present
#define SYSCTL_DC8_ADC1AIN5  0x00200000 // ADC Module 1 AIN5 Pin Present
#define SYSCTL_DC8_ADC1AIN4  0x00100000 // ADC Module 1 AIN4 Pin Present
#define SYSCTL_DC8_ADC1AIN3  0x00080000 // ADC Module 1 AIN3 Pin Present
#define SYSCTL_DC8_ADC1AIN2  0x00040000 // ADC Module 1 AIN2 Pin Present
#define SYSCTL_DC8_ADC1AIN1  0x00020000 // ADC Module 1 AIN1 Pin Present
#define SYSCTL_DC8_ADC1AIN0  0x00010000 // ADC Module 1 AIN0 Pin Present
#define SYSCTL_DC8_ADC0AIN15 0x00008000 // ADC Module 0 AIN15 Pin Present
#define SYSCTL_DC8_ADC0AIN14 0x00004000 // ADC Module 0 AIN14 Pin Present
#define SYSCTL_DC8_ADC0AIN13 0x00002000 // ADC Module 0 AIN13 Pin Present
#define SYSCTL_DC8_ADC0AIN12 0x00001000 // ADC Module 0 AIN12 Pin Present
#define SYSCTL_DC8_ADC0AIN11 0x00000800 // ADC Module 0 AIN11 Pin Present
#define SYSCTL_DC8_ADC0AIN10 0x00000400 // ADC Module 0 AIN10 Pin Present
#define SYSCTL_DC8_ADC0AIN9  0x00000200 // ADC Module 0 AIN9 Pin Present
#define SYSCTL_DC8_ADC0AIN8  0x00000100 // ADC Module 0 AIN8 Pin Present
#define SYSCTL_DC8_ADC0AIN7  0x00000080 // ADC Module 0 AIN7 Pin Present
#define SYSCTL_DC8_ADC0AIN6  0x00000040 // ADC Module 0 AIN6 Pin Present
#define SYSCTL_DC8_ADC0AIN5  0x00000020 // ADC Module 0 AIN5 Pin Present
#define SYSCTL_DC8_ADC0AIN4  0x00000010 // ADC Module 0 AIN4 Pin Present
#define SYSCTL_DC8_ADC0AIN3  0x00000008 // ADC Module 0 AIN3 Pin Present
#define SYSCTL_DC8_ADC0AIN2  0x00000004 // ADC Module 0 AIN2 Pin Present
#define SYSCTL_DC8_ADC0AIN1  0x00000002 // ADC Module 0 AIN1 Pin Present
#define SYSCTL_DC8_ADC0AIN0  0x00000001 // ADC Module 0 AIN0 Pin Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PBORCTL register.
//
//*****************************************************************************
#define SYSCTL_PBORCTL_BOR0 0x00000004 // VDD under BOR0 Event Action
#define SYSCTL_PBORCTL_BOR1 0x00000002 // VDD under BOR1 Event Action

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PTBOCTL register.
//
//*****************************************************************************
#define SYSCTL_PTBOCTL_VDDA_UBOR_M      0x00000300 // VDDA under BOR Event Action
#define SYSCTL_PTBOCTL_VDDA_UBOR_NONE   0x00000000 // No Action
#define SYSCTL_PTBOCTL_VDDA_UBOR_SYSINT 0x00000100 // System control interrupt
#define SYSCTL_PTBOCTL_VDDA_UBOR_NMI    0x00000200 // NMI
#define SYSCTL_PTBOCTL_VDDA_UBOR_RST    0x00000300 // Reset
#define SYSCTL_PTBOCTL_VDD_UBOR_M \
    0x00000003                                     // VDD (VDDS) under BOR Event
                                                   // Action
#define SYSCTL_PTBOCTL_VDD_UBOR_NONE   0x00000000  // No Action
#define SYSCTL_PTBOCTL_VDD_UBOR_SYSINT 0x00000001  // System control interrupt
#define SYSCTL_PTBOCTL_VDD_UBOR_NMI    0x00000002  // NMI
#define SYSCTL_PTBOCTL_VDD_UBOR_RST    0x00000003  // Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCR0 register.
//
//*****************************************************************************
#define SYSCTL_SRCR0_WDT1 0x10000000 // WDT1 Reset Control
#define SYSCTL_SRCR0_CAN1 0x02000000 // CAN1 Reset Control
#define SYSCTL_SRCR0_CAN0 0x01000000 // CAN0 Reset Control
#define SYSCTL_SRCR0_PWM0 0x00100000 // PWM Reset Control
#define SYSCTL_SRCR0_ADC1 0x00020000 // ADC1 Reset Control
#define SYSCTL_SRCR0_ADC0 0x00010000 // ADC0 Reset Control
#define SYSCTL_SRCR0_HIB  0x00000040 // HIB Reset Control
#define SYSCTL_SRCR0_WDT0 0x00000008 // WDT0 Reset Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCR1 register.
//
//*****************************************************************************
#define SYSCTL_SRCR1_COMP2  0x04000000 // Analog Comp 2 Reset Control
#define SYSCTL_SRCR1_COMP1  0x02000000 // Analog Comp 1 Reset Control
#define SYSCTL_SRCR1_COMP0  0x01000000 // Analog Comp 0 Reset Control
#define SYSCTL_SRCR1_TIMER3 0x00080000 // Timer 3 Reset Control
#define SYSCTL_SRCR1_TIMER2 0x00040000 // Timer 2 Reset Control
#define SYSCTL_SRCR1_TIMER1 0x00020000 // Timer 1 Reset Control
#define SYSCTL_SRCR1_TIMER0 0x00010000 // Timer 0 Reset Control
#define SYSCTL_SRCR1_I2C1   0x00004000 // I2C1 Reset Control
#define SYSCTL_SRCR1_I2C0   0x00001000 // I2C0 Reset Control
#define SYSCTL_SRCR1_QEI1   0x00000200 // QEI1 Reset Control
#define SYSCTL_SRCR1_QEI0   0x00000100 // QEI0 Reset Control
#define SYSCTL_SRCR1_SSI1   0x00000020 // SSI1 Reset Control
#define SYSCTL_SRCR1_SSI0   0x00000010 // SSI0 Reset Control
#define SYSCTL_SRCR1_UART2  0x00000004 // UART2 Reset Control
#define SYSCTL_SRCR1_UART1  0x00000002 // UART1 Reset Control
#define SYSCTL_SRCR1_UART0  0x00000001 // UART0 Reset Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCR2 register.
//
//*****************************************************************************
#define SYSCTL_SRCR2_USB0  0x00010000 // USB0 Reset Control
#define SYSCTL_SRCR2_UDMA  0x00002000 // Micro-DMA Reset Control
#define SYSCTL_SRCR2_GPIOJ 0x00000100 // Port J Reset Control
#define SYSCTL_SRCR2_GPIOH 0x00000080 // Port H Reset Control
#define SYSCTL_SRCR2_GPIOG 0x00000040 // Port G Reset Control
#define SYSCTL_SRCR2_GPIOF 0x00000020 // Port F Reset Control
#define SYSCTL_SRCR2_GPIOE 0x00000010 // Port E Reset Control
#define SYSCTL_SRCR2_GPIOD 0x00000008 // Port D Reset Control
#define SYSCTL_SRCR2_GPIOC 0x00000004 // Port C Reset Control
#define SYSCTL_SRCR2_GPIOB 0x00000002 // Port B Reset Control
#define SYSCTL_SRCR2_GPIOA 0x00000001 // Port A Reset Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RIS register.
//
//*****************************************************************************
#define SYSCTL_RIS_BOR0RIS \
    0x00000800                        // VDD under BOR0 Raw Interrupt
                                      // Status
#define SYSCTL_RIS_VDDARIS \
    0x00000400                        // VDDA Power OK Event Raw
                                      // Interrupt Status
#define SYSCTL_RIS_MOSCPUPRIS \
    0x00000100                        // MOSC Power Up Raw Interrupt
                                      // Status
#define SYSCTL_RIS_USBPLLLRIS \
    0x00000080                        // USB PLL Lock Raw Interrupt
                                      // Status
#define SYSCTL_RIS_PLLLRIS 0x00000040 // PLL Lock Raw Interrupt Status
#define SYSCTL_RIS_MOFRIS \
    0x00000008                        // Main Oscillator Failure Raw
                                      // Interrupt Status
#define SYSCTL_RIS_BOR1RIS \
    0x00000002                        // VDD under BOR1 Raw Interrupt
                                      // Status
#define SYSCTL_RIS_BORRIS \
    0x00000002                        // Brown-Out Reset Raw Interrupt
                                      // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_IMC register.
//
//*****************************************************************************
#define SYSCTL_IMC_BOR0IM    0x00000800 // VDD under BOR0 Interrupt Mask
#define SYSCTL_IMC_VDDAIM    0x00000400 // VDDA Power OK Interrupt Mask
#define SYSCTL_IMC_MOSCPUPIM 0x00000100 // MOSC Power Up Interrupt Mask
#define SYSCTL_IMC_USBPLLLIM 0x00000080 // USB PLL Lock Interrupt Mask
#define SYSCTL_IMC_PLLLIM    0x00000040 // PLL Lock Interrupt Mask
#define SYSCTL_IMC_MOFIM \
    0x00000008                          // Main Oscillator Failure
                                        // Interrupt Mask
#define SYSCTL_IMC_BORIM  0x00000002    // Brown-Out Reset Interrupt Mask
#define SYSCTL_IMC_BOR1IM 0x00000002    // VDD under BOR1 Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_MISC register.
//
//*****************************************************************************
#define SYSCTL_MISC_BOR0MIS \
    0x00000800                         // VDD under BOR0 Masked Interrupt
                                       // Status
#define SYSCTL_MISC_VDDAMIS \
    0x00000400                         // VDDA Power OK Masked Interrupt
                                       // Status
#define SYSCTL_MISC_MOSCPUPMIS \
    0x00000100                         // MOSC Power Up Masked Interrupt
                                       // Status
#define SYSCTL_MISC_USBPLLLMIS \
    0x00000080                         // USB PLL Lock Masked Interrupt
                                       // Status
#define SYSCTL_MISC_PLLLMIS 0x00000040 // PLL Lock Masked Interrupt Status
#define SYSCTL_MISC_MOFMIS \
    0x00000008                         // Main Oscillator Failure Masked
                                       // Interrupt Status
#define SYSCTL_MISC_BORMIS 0x00000002  // BOR Masked Interrupt Status
#define SYSCTL_MISC_BOR1MIS \
    0x00000002                         // VDD under BOR1 Masked Interrupt
                                       // Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RESC register.
//
//*****************************************************************************
#define SYSCTL_RESC_MOSCFAIL 0x00010000 // MOSC Failure Reset
#define SYSCTL_RESC_HSSR     0x00001000 // HSSR Reset
#define SYSCTL_RESC_WDT1     0x00000020 // Watchdog Timer 1 Reset
#define SYSCTL_RESC_SW       0x00000010 // Software Reset
#define SYSCTL_RESC_WDT0     0x00000008 // Watchdog Timer 0 Reset
#define SYSCTL_RESC_BOR      0x00000004 // Brown-Out Reset
#define SYSCTL_RESC_POR      0x00000002 // Power-On Reset
#define SYSCTL_RESC_EXT      0x00000001 // External Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PWRTC register.
//
//*****************************************************************************
#define SYSCTL_PWRTC_VDDA_UBOR 0x00000010 // VDDA Under BOR Status
#define SYSCTL_PWRTC_VDD_UBOR  0x00000001 // VDD Under BOR Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCC register.
//
//*****************************************************************************
#define SYSCTL_RCC_ACG          0x08000000 // Auto Clock Gating
#define SYSCTL_RCC_SYSDIV_M     0x07800000 // System Clock Divisor
#define SYSCTL_RCC_USESYSDIV    0x00400000 // Enable System Clock Divider
#define SYSCTL_RCC_USEPWMDIV    0x00100000 // Enable PWM Clock Divisor
#define SYSCTL_RCC_PWMDIV_M     0x000E0000 // PWM Unit Clock Divisor
#define SYSCTL_RCC_PWMDIV_2     0x00000000 // PWM clock /2
#define SYSCTL_RCC_PWMDIV_4     0x00020000 // PWM clock /4
#define SYSCTL_RCC_PWMDIV_8     0x00040000 // PWM clock /8
#define SYSCTL_RCC_PWMDIV_16    0x00060000 // PWM clock /16
#define SYSCTL_RCC_PWMDIV_32    0x00080000 // PWM clock /32
#define SYSCTL_RCC_PWMDIV_64    0x000A0000 // PWM clock /64
#define SYSCTL_RCC_PWRDN        0x00002000 // PLL Power Down
#define SYSCTL_RCC_BYPASS       0x00000800 // PLL Bypass
#define SYSCTL_RCC_XTAL_M       0x000007C0 // Crystal Value
#define SYSCTL_RCC_XTAL_4MHZ    0x00000180 // 4 MHz
#define SYSCTL_RCC_XTAL_4_09MHZ 0x000001C0 // 4.096 MHz
#define SYSCTL_RCC_XTAL_4_91MHZ 0x00000200 // 4.9152 MHz
#define SYSCTL_RCC_XTAL_5MHZ    0x00000240 // 5 MHz
#define SYSCTL_RCC_XTAL_5_12MHZ 0x00000280 // 5.12 MHz
#define SYSCTL_RCC_XTAL_6MHZ    0x000002C0 // 6 MHz
#define SYSCTL_RCC_XTAL_6_14MHZ 0x00000300 // 6.144 MHz
#define SYSCTL_RCC_XTAL_7_37MHZ 0x00000340 // 7.3728 MHz
#define SYSCTL_RCC_XTAL_8MHZ    0x00000380 // 8 MHz
#define SYSCTL_RCC_XTAL_8_19MHZ 0x000003C0 // 8.192 MHz
#define SYSCTL_RCC_XTAL_10MHZ   0x00000400 // 10 MHz
#define SYSCTL_RCC_XTAL_12MHZ   0x00000440 // 12 MHz
#define SYSCTL_RCC_XTAL_12_2MHZ 0x00000480 // 12.288 MHz
#define SYSCTL_RCC_XTAL_13_5MHZ 0x000004C0 // 13.56 MHz
#define SYSCTL_RCC_XTAL_14_3MHZ 0x00000500 // 14.31818 MHz
#define SYSCTL_RCC_XTAL_16MHZ   0x00000540 // 16 MHz
#define SYSCTL_RCC_XTAL_16_3MHZ 0x00000580 // 16.384 MHz
#define SYSCTL_RCC_XTAL_18MHZ   0x000005C0 // 18.0 MHz (USB)
#define SYSCTL_RCC_XTAL_20MHZ   0x00000600 // 20.0 MHz (USB)
#define SYSCTL_RCC_XTAL_24MHZ   0x00000640 // 24.0 MHz (USB)
#define SYSCTL_RCC_XTAL_25MHZ   0x00000680 // 25.0 MHz (USB)
#define SYSCTL_RCC_OSCSRC_M     0x00000030 // Oscillator Source
#define SYSCTL_RCC_OSCSRC_MAIN  0x00000000 // MOSC
#define SYSCTL_RCC_OSCSRC_INT   0x00000010 // IOSC
#define SYSCTL_RCC_OSCSRC_INT4  0x00000020 // IOSC/4
#define SYSCTL_RCC_OSCSRC_30    0x00000030 // LFIOSC
#define SYSCTL_RCC_MOSCDIS      0x00000001 // Main Oscillator Disable
#define SYSCTL_RCC_SYSDIV_S     23
#define SYSCTL_RCC_XTAL_S       6          // Shift to the XTAL field

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_NMIC register.
//
//*****************************************************************************
#define SYSCTL_NMIC_MOSCFAIL 0x00010000 // MOSC Failure NMI
#define SYSCTL_NMIC_TAMPER   0x00000200 // Tamper Event NMI
#define SYSCTL_NMIC_WDT1     0x00000020 // Watch Dog Timer (WDT) 1 NMI
#define SYSCTL_NMIC_WDT0     0x00000008 // Watch Dog Timer (WDT) 0 NMI
#define SYSCTL_NMIC_POWER    0x00000004 // Power/Brown Out Event NMI
#define SYSCTL_NMIC_EXTERNAL 0x00000001 // External Pin NMI

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_GPIOHBCTL
// register.
//
//*****************************************************************************
#define SYSCTL_GPIOHBCTL_PORTJ \
    0x00000100 // Port J Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTH \
    0x00000080 // Port H Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTG \
    0x00000040 // Port G Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTF \
    0x00000020 // Port F Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTE \
    0x00000010 // Port E Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTD \
    0x00000008 // Port D Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTC \
    0x00000004 // Port C Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTB \
    0x00000002 // Port B Advanced High-Performance
               // Bus
#define SYSCTL_GPIOHBCTL_PORTA \
    0x00000001 // Port A Advanced High-Performance
               // Bus

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCC2 register.
//
//*****************************************************************************
#define SYSCTL_RCC2_USERCC2 0x80000000     // Use RCC2
#define SYSCTL_RCC2_DIV400 \
    0x40000000                             // Divide PLL as 400 MHz vs. 200
                                           // MHz
#define SYSCTL_RCC2_SYSDIV2_M   0x1F800000 // System Clock Divisor 2
#define SYSCTL_RCC2_SYSDIV2LSB  0x00400000 // Additional LSB for SYSDIV2
#define SYSCTL_RCC2_USBPWRDN    0x00004000 // Power-Down USB PLL
#define SYSCTL_RCC2_PWRDN2      0x00002000 // Power-Down PLL 2
#define SYSCTL_RCC2_BYPASS2     0x00000800 // PLL Bypass 2
#define SYSCTL_RCC2_OSCSRC2_M   0x00000070 // Oscillator Source 2
#define SYSCTL_RCC2_OSCSRC2_MO  0x00000000 // MOSC
#define SYSCTL_RCC2_OSCSRC2_IO  0x00000010 // PIOSC
#define SYSCTL_RCC2_OSCSRC2_IO4 0x00000020 // PIOSC/4
#define SYSCTL_RCC2_OSCSRC2_30  0x00000030 // LFIOSC
#define SYSCTL_RCC2_OSCSRC2_32  0x00000070 // 32.768 kHz
#define SYSCTL_RCC2_SYSDIV2_S   23

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_MOSCCTL register.
//
//*****************************************************************************
#define SYSCTL_MOSCCTL_OSCRNG 0x00000010 // Oscillator Range
#define SYSCTL_MOSCCTL_PWRDN  0x00000008 // Power Down
#define SYSCTL_MOSCCTL_NOXTAL 0x00000004 // No Crystal Connected
#define SYSCTL_MOSCCTL_MOSCIM 0x00000002 // MOSC Failure Action
#define SYSCTL_MOSCCTL_CVAL   0x00000001 // Clock Validation for MOSC

