fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RSCLKCFG
// register.
//
//*****************************************************************************
#define SYSCTL_RSCLKCFG_MEMTIMU      0x80000000  // Memory Timing Register Update
#define SYSCTL_RSCLKCFG_NEWFREQ      0x40000000  // New PLLFREQ Accept
#define SYSCTL_RSCLKCFG_ACG          0x20000000  // Auto Clock Gating
#define SYSCTL_RSCLKCFG_USEPLL       0x10000000  // Use PLL
#define SYSCTL_RSCLKCFG_PLLSRC_M     0x0F000000  // PLL Source
#define SYSCTL_RSCLKCFG_PLLSRC_PIOSC 0x00000000  // PIOSC is PLL input clock source
#define SYSCTL_RSCLKCFG_PLLSRC_MOSC \
    0x03000000                                   // MOSC is the PLL input clock
                                                 // source
#define SYSCTL_RSCLKCFG_OSCSRC_M      0x00F00000 // Oscillator Source
#define SYSCTL_RSCLKCFG_OSCSRC_PIOSC  0x00000000 // PIOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_LFIOSC 0x00200000 // LFIOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_MOSC   0x00300000 // MOSC is oscillator source
#define SYSCTL_RSCLKCFG_OSCSRC_RTC \
    0x00400000                                   // Hibernation Module RTC
                                                 // Oscillator (RTCOSC)
#define SYSCTL_RSCLKCFG_OSYSDIV_M 0x000FFC00     // Oscillator System Clock Divisor
#define SYSCTL_RSCLKCFG_PSYSDIV_M 0x000003FF     // PLL System Clock Divisor
#define SYSCTL_RSCLKCFG_OSYSDIV_S 10
#define SYSCTL_RSCLKCFG_PSYSDIV_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_MEMTIM0 register.
//
//*****************************************************************************
#define SYSCTL_MEMTIM0_EBCHT_M   0x03C00000 // EEPROM Clock High Time
#define SYSCTL_MEMTIM0_EBCHT_0_5 0x00000000 // 1/2 system clock period
#define SYSCTL_MEMTIM0_EBCHT_1   0x00400000 // 1 system clock period
#define SYSCTL_MEMTIM0_EBCHT_1_5 0x00800000 // 1.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_2   0x00C00000 // 2 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_2_5 0x01000000 // 2.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_3   0x01400000 // 3 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_3_5 0x01800000 // 3.5 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_4   0x01C00000 // 4 system clock periods
#define SYSCTL_MEMTIM0_EBCHT_4_5 0x02000000 // 4.5 system clock periods
#define SYSCTL_MEMTIM0_EBCE      0x00200000 // EEPROM Bank Clock Edge
#define SYSCTL_MEMTIM0_MB1       0x00100010 // Must be one
#define SYSCTL_MEMTIM0_EWS_M     0x000F0000 // EEPROM Wait States
#define SYSCTL_MEMTIM0_FBCHT_M   0x000003C0 // Flash Bank Clock High Time
#define SYSCTL_MEMTIM0_FBCHT_0_5 0x00000000 // 1/2 system clock period
#define SYSCTL_MEMTIM0_FBCHT_1   0x00000040 // 1 system clock period
#define SYSCTL_MEMTIM0_FBCHT_1_5 0x00000080 // 1.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_2   0x000000C0 // 2 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_2_5 0x00000100 // 2.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_3   0x00000140 // 3 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_3_5 0x00000180 // 3.5 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_4   0x000001C0 // 4 system clock periods
#define SYSCTL_MEMTIM0_FBCHT_4_5 0x00000200 // 4.5 system clock periods
#define SYSCTL_MEMTIM0_FBCE      0x00000020 // Flash Bank Clock Edge
#define SYSCTL_MEMTIM0_FWS_M     0x0000000F // Flash Wait State
#define SYSCTL_MEMTIM0_EWS_S     16
#define SYSCTL_MEMTIM0_FWS_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGC0 register.
//
//*****************************************************************************
#define SYSCTL_RCGC0_WDT1         0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_RCGC0_CAN1         0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_RCGC0_CAN0         0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_RCGC0_PWM0         0x00100000 // PWM Clock Gating Control
#define SYSCTL_RCGC0_ADC1         0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_RCGC0_ADC0         0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_RCGC0_ADC1SPD_M    0x00000C00 // ADC1 Sample Speed
#define SYSCTL_RCGC0_ADC1SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_RCGC0_ADC1SPD_250K 0x00000400 // 250K samples/second
#define SYSCTL_RCGC0_ADC1SPD_500K 0x00000800 // 500K samples/second
#define SYSCTL_RCGC0_ADC1SPD_1M   0x00000C00 // 1M samples/second
#define SYSCTL_RCGC0_ADC0SPD_M    0x00000300 // ADC0 Sample Speed
#define SYSCTL_RCGC0_ADC0SPD_125K 0x00000000 // 125K samples/second
#define SYSCTL_RCGC0_ADC0SPD_250K 0x00000100 // 250K samples/second
#define SYSCTL_RCGC0_ADC0SPD_500K 0x00000200 // 500K samples/second
#define SYSCTL_RCGC0_ADC0SPD_1M   0x00000300 // 1M samples/second
#define SYSCTL_RCGC0_HIB          0x00000040 // HIB Clock Gating Control
#define SYSCTL_RCGC0_WDT0         0x00000008 // WDT0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGC1 register.
//
//*****************************************************************************
#define SYSCTL_RCGC1_COMP2  0x04000000 // Analog Comparator 2 Clock Gating
#define SYSCTL_RCGC1_COMP1  0x02000000 // Analog Comparator 1 Clock Gating
#define SYSCTL_RCGC1_COMP0  0x01000000 // Analog Comparator 0 Clock Gating
#define SYSCTL_RCGC1_TIMER3 0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_RCGC1_TIMER2 0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_RCGC1_TIMER1 0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_RCGC1_TIMER0 0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_RCGC1_I2C1   0x00004000 // I2C1 Clock Gating Control
#define SYSCTL_RCGC1_I2C0   0x00001000 // I2C0 Clock Gating Control
#define SYSCTL_RCGC1_QEI1   0x00000200 // QEI1 Clock Gating Control
#define SYSCTL_RCGC1_QEI0   0x00000100 // QEI0 Clock Gating Control
#define SYSCTL_RCGC1_SSI1   0x00000020 // SSI1 Clock Gating Control
#define SYSCTL_RCGC1_SSI0   0x00000010 // SSI0 Clock Gating Control
#define SYSCTL_RCGC1_UART2  0x00000004 // UART2 Clock Gating Control
#define SYSCTL_RCGC1_UART1  0x00000002 // UART1 Clock Gating Control
#define SYSCTL_RCGC1_UART0  0x00000001 // UART0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGC2 register.
//
//*****************************************************************************
#define SYSCTL_RCGC2_USB0  0x00010000 // USB0 Clock Gating Control
#define SYSCTL_RCGC2_UDMA  0x00002000 // Micro-DMA Clock Gating Control
#define SYSCTL_RCGC2_GPIOJ 0x00000100 // Port J Clock Gating Control
#define SYSCTL_RCGC2_GPIOH 0x00000080 // Port H Clock Gating Control
#define SYSCTL_RCGC2_GPIOG 0x00000040 // Port G Clock Gating Control
#define SYSCTL_RCGC2_GPIOF 0x00000020 // Port F Clock Gating Control
#define SYSCTL_RCGC2_GPIOE 0x00000010 // Port E Clock Gating Control
#define SYSCTL_RCGC2_GPIOD 0x00000008 // Port D Clock Gating Control
#define SYSCTL_RCGC2_GPIOC 0x00000004 // Port C Clock Gating Control
#define SYSCTL_RCGC2_GPIOB 0x00000002 // Port B Clock Gating Control
#define SYSCTL_RCGC2_GPIOA 0x00000001 // Port A Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGC0 register.
//
//*****************************************************************************
#define SYSCTL_SCGC0_WDT1     0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_SCGC0_CAN1     0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_SCGC0_CAN0     0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_SCGC0_PWM0     0x00100000 // PWM Clock Gating Control
#define SYSCTL_SCGC0_ADC1     0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_SCGC0_ADC0     0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_SCGC0_ADCSPD_M 0x00000F00 // ADC Sample Speed
#define SYSCTL_SCGC0_HIB      0x00000040 // HIB Clock Gating Control
#define SYSCTL_SCGC0_WDT0     0x00000008 // WDT0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGC1 register.
//
//*****************************************************************************
#define SYSCTL_SCGC1_COMP2  0x04000000 // Analog Comparator 2 Clock Gating
#define SYSCTL_SCGC1_COMP1  0x02000000 // Analog Comparator 1 Clock Gating
#define SYSCTL_SCGC1_COMP0  0x01000000 // Analog Comparator 0 Clock Gating
#define SYSCTL_SCGC1_TIMER3 0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_SCGC1_TIMER2 0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_SCGC1_TIMER1 0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_SCGC1_TIMER0 0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_SCGC1_I2C1   0x00004000 // I2C1 Clock Gating Control
#define SYSCTL_SCGC1_I2C0   0x00001000 // I2C0 Clock Gating Control
#define SYSCTL_SCGC1_QEI1   0x00000200 // QEI1 Clock Gating Control
#define SYSCTL_SCGC1_QEI0   0x00000100 // QEI0 Clock Gating Control
#define SYSCTL_SCGC1_SSI1   0x00000020 // SSI1 Clock Gating Control
#define SYSCTL_SCGC1_SSI0   0x00000010 // SSI0 Clock Gating Control
#define SYSCTL_SCGC1_UART2  0x00000004 // UART2 Clock Gating Control
#define SYSCTL_SCGC1_UART1  0x00000002 // UART1 Clock Gating Control
#define SYSCTL_SCGC1_UART0  0x00000001 // UART0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGC2 register.
//
//*****************************************************************************
#define SYSCTL_SCGC2_USB0  0x00010000 // USB0 Clock Gating Control
#define SYSCTL_SCGC2_UDMA  0x00002000 // Micro-DMA Clock Gating Control
#define SYSCTL_SCGC2_GPIOJ 0x00000100 // Port J Clock Gating Control
#define SYSCTL_SCGC2_GPIOH 0x00000080 // Port H Clock Gating Control
#define SYSCTL_SCGC2_GPIOG 0x00000040 // Port G Clock Gating Control
#define SYSCTL_SCGC2_GPIOF 0x00000020 // Port F Clock Gating Control
#define SYSCTL_SCGC2_GPIOE 0x00000010 // Port E Clock Gating Control
#define SYSCTL_SCGC2_GPIOD 0x00000008 // Port D Clock Gating Control
#define SYSCTL_SCGC2_GPIOC 0x00000004 // Port C Clock Gating Control
#define SYSCTL_SCGC2_GPIOB 0x00000002 // Port B Clock Gating Control
#define SYSCTL_SCGC2_GPIOA 0x00000001 // Port A Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGC0 register.
//
//*****************************************************************************
#define SYSCTL_DCGC0_WDT1 0x10000000 // WDT1 Clock Gating Control
#define SYSCTL_DCGC0_CAN1 0x02000000 // CAN1 Clock Gating Control
#define SYSCTL_DCGC0_CAN0 0x01000000 // CAN0 Clock Gating Control
#define SYSCTL_DCGC0_PWM0 0x00100000 // PWM Clock Gating Control
#define SYSCTL_DCGC0_ADC1 0x00020000 // ADC1 Clock Gating Control
#define SYSCTL_DCGC0_ADC0 0x00010000 // ADC0 Clock Gating Control
#define SYSCTL_DCGC0_HIB  0x00000040 // HIB Clock Gating Control
#define SYSCTL_DCGC0_WDT0 0x00000008 // WDT0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGC1 register.
//
//*****************************************************************************
#define SYSCTL_DCGC1_COMP2  0x04000000 // Analog Comparator 2 Clock Gating
#define SYSCTL_DCGC1_COMP1  0x02000000 // Analog Comparator 1 Clock Gating
#define SYSCTL_DCGC1_COMP0  0x01000000 // Analog Comparator 0 Clock Gating
#define SYSCTL_DCGC1_TIMER3 0x00080000 // Timer 3 Clock Gating Control
#define SYSCTL_DCGC1_TIMER2 0x00040000 // Timer 2 Clock Gating Control
#define SYSCTL_DCGC1_TIMER1 0x00020000 // Timer 1 Clock Gating Control
#define SYSCTL_DCGC1_TIMER0 0x00010000 // Timer 0 Clock Gating Control
#define SYSCTL_DCGC1_I2C1   0x00004000 // I2C1 Clock Gating Control
#define SYSCTL_DCGC1_I2C0   0x00001000 // I2C0 Clock Gating Control
#define SYSCTL_DCGC1_QEI1   0x00000200 // QEI1 Clock Gating Control
#define SYSCTL_DCGC1_QEI0   0x00000100 // QEI0 Clock Gating Control
#define SYSCTL_DCGC1_SSI1   0x00000020 // SSI1 Clock Gating Control
#define SYSCTL_DCGC1_SSI0   0x00000010 // SSI0 Clock Gating Control
#define SYSCTL_DCGC1_UART2  0x00000004 // UART2 Clock Gating Control
#define SYSCTL_DCGC1_UART1  0x00000002 // UART1 Clock Gating Control
#define SYSCTL_DCGC1_UART0  0x00000001 // UART0 Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGC2 register.
//
//*****************************************************************************
#define SYSCTL_DCGC2_USB0  0x00010000 // USB0 Clock Gating Control
#define SYSCTL_DCGC2_UDMA  0x00002000 // Micro-DMA Clock Gating Control
#define SYSCTL_DCGC2_GPIOJ 0x00000100 // Port J Clock Gating Control
#define SYSCTL_DCGC2_GPIOH 0x00000080 // Port H Clock Gating Control
#define SYSCTL_DCGC2_GPIOG 0x00000040 // Port G Clock Gating Control
#define SYSCTL_DCGC2_GPIOF 0x00000020 // Port F Clock Gating Control
#define SYSCTL_DCGC2_GPIOE 0x00000010 // Port E Clock Gating Control
#define SYSCTL_DCGC2_GPIOD 0x00000008 // Port D Clock Gating Control
#define SYSCTL_DCGC2_GPIOC 0x00000004 // Port C Clock Gating Control
#define SYSCTL_DCGC2_GPIOB 0x00000002 // Port B Clock Gating Control
#define SYSCTL_DCGC2_GPIOA 0x00000001 // Port A Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_ALTCLKCFG
// register.
//
//*****************************************************************************
#define SYSCTL_ALTCLKCFG_ALTCLK_M     0x0000000F // Alternate Clock Source
#define SYSCTL_ALTCLKCFG_ALTCLK_PIOSC 0x00000000 // PIOSC
#define SYSCTL_ALTCLKCFG_ALTCLK_RTCOSC \
    0x00000003                                   // Hibernation Module Real-time
                                                 // clock output (RTCOSC)
#define SYSCTL_ALTCLKCFG_ALTCLK_LFIOSC \
    0x00000004                                   // Low-frequency internal
                                                 // oscillator (LFIOSC)

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DSLPCLKCFG
// register.
//
//*****************************************************************************
#define SYSCTL_DSLPCLKCFG_D_M     0x1F800000 // Divider Field Override
#define SYSCTL_DSLPCLKCFG_O_M     0x00000070 // Clock Source
#define SYSCTL_DSLPCLKCFG_O_IGN   0x00000000 // MOSC
#define SYSCTL_DSLPCLKCFG_O_IO    0x00000010 // PIOSC
#define SYSCTL_DSLPCLKCFG_O_30    0x00000030 // LFIOSC
#define SYSCTL_DSLPCLKCFG_O_32    0x00000070 // 32.768 kHz
#define SYSCTL_DSLPCLKCFG_PIOSCPD 0x00000002 // PIOSC Power Down Request
#define SYSCTL_DSLPCLKCFG_D_S     23

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DSCLKCFG
// register.
//
//*****************************************************************************
#define SYSCTL_DSCLKCFG_PIOSCPD         0x80000000 // PIOSC Power Down
#define SYSCTL_DSCLKCFG_MOSCDPD         0x40000000 // MOSC Disable Power Down
#define SYSCTL_DSCLKCFG_DSOSCSRC_M      0x00F00000 // Deep Sleep Oscillator Source
#define SYSCTL_DSCLKCFG_DSOSCSRC_PIOSC  0x00000000 // PIOSC
#define SYSCTL_DSCLKCFG_DSOSCSRC_LFIOSC 0x00200000 // LFIOSC
#define SYSCTL_DSCLKCFG_DSOSCSRC_MOSC   0x00300000 // MOSC
#define SYSCTL_DSCLKCFG_DSOSCSRC_RTC    0x00400000 // Hibernation Module RTCOSC
#define SYSCTL_DSCLKCFG_DSSYSDIV_M      0x000003FF // Deep Sleep Clock Divisor
#define SYSCTL_DSCLKCFG_DSSYSDIV_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DIVSCLK register.
//
//*****************************************************************************
#define SYSCTL_DIVSCLK_EN         0x80000000 // DIVSCLK Enable
#define SYSCTL_DIVSCLK_SRC_M      0x00030000 // Clock Source
#define SYSCTL_DIVSCLK_SRC_SYSCLK 0x00000000 // System Clock
#define SYSCTL_DIVSCLK_SRC_PIOSC  0x00010000 // PIOSC
#define SYSCTL_DIVSCLK_SRC_MOSC   0x00020000 // MOSC
#define SYSCTL_DIVSCLK_DIV_M      0x000000FF // Divisor Value
#define SYSCTL_DIVSCLK_DIV_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SYSPROP register.
//
//*****************************************************************************
#define SYSCTL_SYSPROP_FPU 0x00000001 // FPU Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PIOSCCAL
// register.
//
//*****************************************************************************
#define SYSCTL_PIOSCCAL_UTEN   0x80000000 // Use User Trim Value
#define SYSCTL_PIOSCCAL_CAL    0x00000200 // Start Calibration
#define SYSCTL_PIOSCCAL_UPDATE 0x00000100 // Update Trim
#define SYSCTL_PIOSCCAL_UT_M   0x0000007F // User Trim Value
#define SYSCTL_PIOSCCAL_UT_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PIOSCSTAT
// register.
//
//*****************************************************************************
#define SYSCTL_PIOSCSTAT_DT_M 0x007F0000 // Default Trim Value
#define SYSCTL_PIOSCSTAT_CR_M 0x00000300 // Calibration Result
#define SYSCTL_PIOSCSTAT_CRNONE \
    0x00000000                           // Calibration has not been
                                         // attempted
#define SYSCTL_PIOSCSTAT_CRPASS \
    0x00000100                           // The last calibration operation
                                         // completed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CRFAIL \
    0x00000200                           // The last calibration operation
                                         // failed to meet 1% accuracy
#define SYSCTL_PIOSCSTAT_CT_M 0x0000007F // Calibration Trim Value
#define SYSCTL_PIOSCSTAT_DT_S 16
#define SYSCTL_PIOSCSTAT_CT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PLLFREQ0
// register.
//
//*****************************************************************************
#define SYSCTL_PLLFREQ0_PLLPWR  0x00800000 // PLL Power
#define SYSCTL_PLLFREQ0_MFRAC_M 0x000FFC00 // PLL M Fractional Value
#define SYSCTL_PLLFREQ0_MINT_M  0x000003FF // PLL M Integer Value
#define SYSCTL_PLLFREQ0_MFRAC_S 10
#define SYSCTL_PLLFREQ0_MINT_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PLLFREQ1
// register.
//
//*****************************************************************************
#define SYSCTL_PLLFREQ1_Q_M 0x00001F00 // PLL Q Value
#define SYSCTL_PLLFREQ1_N_M 0x0000001F // PLL N Value
#define SYSCTL_PLLFREQ1_Q_S 8
#define SYSCTL_PLLFREQ1_N_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PLLSTAT register.
//
//*****************************************************************************
#define SYSCTL_PLLSTAT_LOCK 0x00000001 // PLL Lock

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SLPPWRCFG
// register.
//
//*****************************************************************************
#define SYSCTL_SLPPWRCFG_FLASHPM_M   0x00000030 // Flash Power Modes
#define SYSCTL_SLPPWRCFG_FLASHPM_NRM 0x00000000 // Active Mode
#define SYSCTL_SLPPWRCFG_FLASHPM_SLP 0x00000020 // Low Power Mode
#define SYSCTL_SLPPWRCFG_SRAMPM_M    0x00000003 // SRAM Power Modes
#define SYSCTL_SLPPWRCFG_SRAMPM_NRM  0x00000000 // Active Mode
#define SYSCTL_SLPPWRCFG_SRAMPM_SBY  0x00000001 // Standby Mode
#define SYSCTL_SLPPWRCFG_SRAMPM_LP   0x00000003 // Low Power Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DSLPPWRCFG
// register.
//
//*****************************************************************************
#define SYSCTL_DSLPPWRCFG_LDOSM       0x00000200 // LDO Sleep Mode
#define SYSCTL_DSLPPWRCFG_TSPD        0x00000100 // Temperature Sense Power Down
#define SYSCTL_DSLPPWRCFG_FLASHPM_M   0x00000030 // Flash Power Modes
#define SYSCTL_DSLPPWRCFG_FLASHPM_NRM 0x00000000 // Active Mode
#define SYSCTL_DSLPPWRCFG_FLASHPM_SLP 0x00000020 // Low Power Mode
#define SYSCTL_DSLPPWRCFG_SRAMPM_M    0x00000003 // SRAM Power Modes
#define SYSCTL_DSLPPWRCFG_SRAMPM_NRM  0x00000000 // Active Mode
#define SYSCTL_DSLPPWRCFG_SRAMPM_SBY  0x00000001 // Standby Mode
#define SYSCTL_DSLPPWRCFG_SRAMPM_LP   0x00000003 // Low Power Mode

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC9 register.
//
//*****************************************************************************
#define SYSCTL_DC9_ADC1DC7 0x00800000 // ADC1 DC7 Present
#define SYSCTL_DC9_ADC1DC6 0x00400000 // ADC1 DC6 Present
#define SYSCTL_DC9_ADC1DC5 0x00200000 // ADC1 DC5 Present
#define SYSCTL_DC9_ADC1DC4 0x00100000 // ADC1 DC4 Present
#define SYSCTL_DC9_ADC1DC3 0x00080000 // ADC1 DC3 Present
#define SYSCTL_DC9_ADC1DC2 0x00040000 // ADC1 DC2 Present
#define SYSCTL_DC9_ADC1DC1 0x00020000 // ADC1 DC1 Present
#define SYSCTL_DC9_ADC1DC0 0x00010000 // ADC1 DC0 Present
#define SYSCTL_DC9_ADC0DC7 0x00000080 // ADC0 DC7 Present
#define SYSCTL_DC9_ADC0DC6 0x00000040 // ADC0 DC6 Present
#define SYSCTL_DC9_ADC0DC5 0x00000020 // ADC0 DC5 Present
#define SYSCTL_DC9_ADC0DC4 0x00000010 // ADC0 DC4 Present
#define SYSCTL_DC9_ADC0DC3 0x00000008 // ADC0 DC3 Present
#define SYSCTL_DC9_ADC0DC2 0x00000004 // ADC0 DC2 Present
#define SYSCTL_DC9_ADC0DC1 0x00000002 // ADC0 DC1 Present
#define SYSCTL_DC9_ADC0DC0 0x00000001 // ADC0 DC0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_NVMSTAT register.
//
//*****************************************************************************
#define SYSCTL_NVMSTAT_FWB \
    0x00000001 // 32 Word Flash Write Buffer
               // Available

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_LDOSPCTL
// register.
//
//*****************************************************************************
#define SYSCTL_LDOSPCTL_VADJEN     0x80000000 // Voltage Adjust Enable
#define SYSCTL_LDOSPCTL_VLDO_M     0x000000FF // LDO Output Voltage
#define SYSCTL_LDOSPCTL_VLDO_0_90V 0x00000012 // 0.90 V
#define SYSCTL_LDOSPCTL_VLDO_0_95V 0x00000013 // 0.95 V
#define SYSCTL_LDOSPCTL_VLDO_1_00V 0x00000014 // 1.00 V
#define SYSCTL_LDOSPCTL_VLDO_1_05V 0x00000015 // 1.05 V
#define SYSCTL_LDOSPCTL_VLDO_1_10V 0x00000016 // 1.10 V
#define SYSCTL_LDOSPCTL_VLDO_1_15V 0x00000017 // 1.15 V
#define SYSCTL_LDOSPCTL_VLDO_1_20V 0x00000018 // 1.20 V

