fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_LDODPCTL
// register.
//
//*****************************************************************************
#define SYSCTL_LDODPCTL_VADJEN     0x80000000 // Voltage Adjust Enable
#define SYSCTL_LDODPCTL_VLDO_M     0x000000FF // LDO Output Voltage
#define SYSCTL_LDODPCTL_VLDO_0_90V 0x00000012 // 0.90 V
#define SYSCTL_LDODPCTL_VLDO_0_95V 0x00000013 // 0.95 V
#define SYSCTL_LDODPCTL_VLDO_1_00V 0x00000014 // 1.00 V
#define SYSCTL_LDODPCTL_VLDO_1_05V 0x00000015 // 1.05 V
#define SYSCTL_LDODPCTL_VLDO_1_10V 0x00000016 // 1.10 V
#define SYSCTL_LDODPCTL_VLDO_1_15V 0x00000017 // 1.15 V
#define SYSCTL_LDODPCTL_VLDO_1_20V 0x00000018 // 1.20 V
#define SYSCTL_LDODPCTL_VLDO_1_25V 0x00000019 // 1.25 V
#define SYSCTL_LDODPCTL_VLDO_1_30V 0x0000001A // 1.30 V
#define SYSCTL_LDODPCTL_VLDO_1_35V 0x0000001B // 1.35 V

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RESBEHAVCTL
// register.
//
//*****************************************************************************
#define SYSCTL_RESBEHAVCTL_WDOG1_M 0x000000C0  // Watchdog 1 Reset Operation
#define SYSCTL_RESBEHAVCTL_WDOG1_SYSRST \
    0x00000080                                 // Watchdog 1 issues a system
                                               // reset. The application starts
                                               // within 10 us
#define SYSCTL_RESBEHAVCTL_WDOG1_POR \
    0x000000C0                                 // Watchdog 1 issues a simulated
                                               // POR sequence. Application starts
                                               // less than 500 us after
                                               // deassertion (Default)
#define SYSCTL_RESBEHAVCTL_WDOG0_M 0x00000030  // Watchdog 0 Reset Operation
#define SYSCTL_RESBEHAVCTL_WDOG0_SYSRST \
    0x00000020                                 // Watchdog 0 issues a system
                                               // reset. The application starts
                                               // within 10 us
#define SYSCTL_RESBEHAVCTL_WDOG0_POR \
    0x00000030                                 // Watchdog 0 issues a simulated
                                               // POR sequence. Application starts
                                               // less than 500 us after
                                               // deassertion (Default)
#define SYSCTL_RESBEHAVCTL_BOR_M 0x0000000C    // BOR Reset operation
#define SYSCTL_RESBEHAVCTL_BOR_SYSRST \
    0x00000008                                 // Brown Out Reset issues system
                                               // reset. The application starts
                                               // within 10 us
#define SYSCTL_RESBEHAVCTL_BOR_POR \
    0x0000000C                                 // Brown Out Reset issues a
                                               // simulated POR sequence. The
                                               // application starts less than 500
                                               // us after deassertion (Default)
#define SYSCTL_RESBEHAVCTL_EXTRES_M 0x00000003 // External RST Pin Operation
#define SYSCTL_RESBEHAVCTL_EXTRES_SYSRST \
    0x00000002                                 // External RST assertion issues a
                                               // system reset. The application
                                               // starts within 10 us
#define SYSCTL_RESBEHAVCTL_EXTRES_POR \
    0x00000003                                 // External RST assertion issues a
                                               // simulated POR sequence.
                                               // Application starts less than 500
                                               // us after deassertion (Default)

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_HSSR register.
//
//*****************************************************************************
#define SYSCTL_HSSR_KEY_M   0xFF000000 // Write Key
#define SYSCTL_HSSR_CDOFF_M 0x00FFFFFF // Command Descriptor Pointer
#define SYSCTL_HSSR_KEY_S   24
#define SYSCTL_HSSR_CDOFF_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_USBPDS register.
//
//*****************************************************************************
#define SYSCTL_USBPDS_MEMSTAT_M      0x0000000C // Memory Array Power Status
#define SYSCTL_USBPDS_MEMSTAT_OFF    0x00000000 // Array OFF
#define SYSCTL_USBPDS_MEMSTAT_RETAIN 0x00000004 // SRAM Retention
#define SYSCTL_USBPDS_MEMSTAT_ON     0x0000000C // Array On
#define SYSCTL_USBPDS_PWRSTAT_M      0x00000003 // Power Domain Status
#define SYSCTL_USBPDS_PWRSTAT_OFF    0x00000000 // OFF
#define SYSCTL_USBPDS_PWRSTAT_ON     0x00000003 // ON

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_USBMPC register.
//
//*****************************************************************************
#define SYSCTL_USBMPC_PWRCTL_M      0x00000003 // Memory Array Power Control
#define SYSCTL_USBMPC_PWRCTL_OFF    0x00000000 // Array OFF
#define SYSCTL_USBMPC_PWRCTL_RETAIN 0x00000001 // SRAM Retention
#define SYSCTL_USBMPC_PWRCTL_ON     0x00000003 // Array On

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_EMACPDS register.
//
//*****************************************************************************
#define SYSCTL_EMACPDS_MEMSTAT_M   0x0000000C // Memory Array Power Status
#define SYSCTL_EMACPDS_MEMSTAT_OFF 0x00000000 // Array OFF
#define SYSCTL_EMACPDS_MEMSTAT_ON  0x0000000C // Array On
#define SYSCTL_EMACPDS_PWRSTAT_M   0x00000003 // Power Domain Status
#define SYSCTL_EMACPDS_PWRSTAT_OFF 0x00000000 // OFF
#define SYSCTL_EMACPDS_PWRSTAT_ON  0x00000003 // ON

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_EMACMPC register.
//
//*****************************************************************************
#define SYSCTL_EMACMPC_PWRCTL_M   0x00000003 // Memory Array Power Control
#define SYSCTL_EMACMPC_PWRCTL_OFF 0x00000000 // Array OFF
#define SYSCTL_EMACMPC_PWRCTL_ON  0x00000003 // Array On

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_LCDMPC register.
//
//*****************************************************************************
#define SYSCTL_LCDMPC_PWRCTL_M   0x00000003 // Memory Array Power Control
#define SYSCTL_LCDMPC_PWRCTL_OFF 0x00000000 // Array OFF
#define SYSCTL_LCDMPC_PWRCTL_ON  0x00000003 // Array On

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPWD register.
//
//*****************************************************************************
#define SYSCTL_PPWD_P1 0x00000002 // Watchdog Timer 1 Present
#define SYSCTL_PPWD_P0 0x00000001 // Watchdog Timer 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPTIMER register.
//
//*****************************************************************************
#define SYSCTL_PPTIMER_P7 \
    0x00000080 // 16/32-Bit General-Purpose Timer
               // 7 Present
#define SYSCTL_PPTIMER_P6 \
    0x00000040 // 16/32-Bit General-Purpose Timer
               // 6 Present
#define SYSCTL_PPTIMER_P5 \
    0x00000020 // 16/32-Bit General-Purpose Timer
               // 5 Present
#define SYSCTL_PPTIMER_P4 \
    0x00000010 // 16/32-Bit General-Purpose Timer
               // 4 Present
#define SYSCTL_PPTIMER_P3 \
    0x00000008 // 16/32-Bit General-Purpose Timer
               // 3 Present
#define SYSCTL_PPTIMER_P2 \
    0x00000004 // 16/32-Bit General-Purpose Timer
               // 2 Present
#define SYSCTL_PPTIMER_P1 \
    0x00000002 // 16/32-Bit General-Purpose Timer
               // 1 Present
#define SYSCTL_PPTIMER_P0 \
    0x00000001 // 16/32-Bit General-Purpose Timer
               // 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPGPIO register.
//
//*****************************************************************************
#define SYSCTL_PPGPIO_P17 0x00020000 // GPIO Port T Present
#define SYSCTL_PPGPIO_P16 0x00010000 // GPIO Port S Present
#define SYSCTL_PPGPIO_P15 0x00008000 // GPIO Port R Present
#define SYSCTL_PPGPIO_P14 0x00004000 // GPIO Port Q Present
#define SYSCTL_PPGPIO_P13 0x00002000 // GPIO Port P Present
#define SYSCTL_PPGPIO_P12 0x00001000 // GPIO Port N Present
#define SYSCTL_PPGPIO_P11 0x00000800 // GPIO Port M Present
#define SYSCTL_PPGPIO_P10 0x00000400 // GPIO Port L Present
#define SYSCTL_PPGPIO_P9  0x00000200 // GPIO Port K Present
#define SYSCTL_PPGPIO_P8  0x00000100 // GPIO Port J Present
#define SYSCTL_PPGPIO_P7  0x00000080 // GPIO Port H Present
#define SYSCTL_PPGPIO_P6  0x00000040 // GPIO Port G Present
#define SYSCTL_PPGPIO_P5  0x00000020 // GPIO Port F Present
#define SYSCTL_PPGPIO_P4  0x00000010 // GPIO Port E Present
#define SYSCTL_PPGPIO_P3  0x00000008 // GPIO Port D Present
#define SYSCTL_PPGPIO_P2  0x00000004 // GPIO Port C Present
#define SYSCTL_PPGPIO_P1  0x00000002 // GPIO Port B Present
#define SYSCTL_PPGPIO_P0  0x00000001 // GPIO Port A Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPDMA register.
//
//*****************************************************************************
#define SYSCTL_PPDMA_P0 0x00000001 // uDMA Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPEPI register.
//
//*****************************************************************************
#define SYSCTL_PPEPI_P0 0x00000001 // EPI Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPHIB register.
//
//*****************************************************************************
#define SYSCTL_PPHIB_P0 0x00000001 // Hibernation Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPUART register.
//
//*****************************************************************************
#define SYSCTL_PPUART_P7 0x00000080 // UART Module 7 Present
#define SYSCTL_PPUART_P6 0x00000040 // UART Module 6 Present
#define SYSCTL_PPUART_P5 0x00000020 // UART Module 5 Present
#define SYSCTL_PPUART_P4 0x00000010 // UART Module 4 Present
#define SYSCTL_PPUART_P3 0x00000008 // UART Module 3 Present
#define SYSCTL_PPUART_P2 0x00000004 // UART Module 2 Present
#define SYSCTL_PPUART_P1 0x00000002 // UART Module 1 Present
#define SYSCTL_PPUART_P0 0x00000001 // UART Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPSSI register.
//
//*****************************************************************************
#define SYSCTL_PPSSI_P3 0x00000008 // SSI Module 3 Present
#define SYSCTL_PPSSI_P2 0x00000004 // SSI Module 2 Present
#define SYSCTL_PPSSI_P1 0x00000002 // SSI Module 1 Present
#define SYSCTL_PPSSI_P0 0x00000001 // SSI Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPI2C register.
//
//*****************************************************************************
#define SYSCTL_PPI2C_P9 0x00000200 // I2C Module 9 Present
#define SYSCTL_PPI2C_P8 0x00000100 // I2C Module 8 Present
#define SYSCTL_PPI2C_P7 0x00000080 // I2C Module 7 Present
#define SYSCTL_PPI2C_P6 0x00000040 // I2C Module 6 Present
#define SYSCTL_PPI2C_P5 0x00000020 // I2C Module 5 Present
#define SYSCTL_PPI2C_P4 0x00000010 // I2C Module 4 Present
#define SYSCTL_PPI2C_P3 0x00000008 // I2C Module 3 Present
#define SYSCTL_PPI2C_P2 0x00000004 // I2C Module 2 Present
#define SYSCTL_PPI2C_P1 0x00000002 // I2C Module 1 Present
#define SYSCTL_PPI2C_P0 0x00000001 // I2C Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPUSB register.
//
//*****************************************************************************
#define SYSCTL_PPUSB_P0 0x00000001 // USB Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPEPHY register.
//
//*****************************************************************************
#define SYSCTL_PPEPHY_P0 0x00000001 // Ethernet PHY Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPCAN register.
//
//*****************************************************************************
#define SYSCTL_PPCAN_P1 0x00000002 // CAN Module 1 Present
#define SYSCTL_PPCAN_P0 0x00000001 // CAN Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPADC register.
//
//*****************************************************************************
#define SYSCTL_PPADC_P1 0x00000002 // ADC Module 1 Present
#define SYSCTL_PPADC_P0 0x00000001 // ADC Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPACMP register.
//
//*****************************************************************************
#define SYSCTL_PPACMP_P0 0x00000001 // Analog Comparator Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPPWM register.
//
//*****************************************************************************
#define SYSCTL_PPPWM_P1 0x00000002 // PWM Module 1 Present
#define SYSCTL_PPPWM_P0 0x00000001 // PWM Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPQEI register.
//
//*****************************************************************************
#define SYSCTL_PPQEI_P1 0x00000002 // QEI Module 1 Present
#define SYSCTL_PPQEI_P0 0x00000001 // QEI Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPLPC register.
//
//*****************************************************************************
#define SYSCTL_PPLPC_P0 0x00000001 // LPC Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPPECI register.
//
//*****************************************************************************
#define SYSCTL_PPPECI_P0 0x00000001 // PECI Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPFAN register.
//
//*****************************************************************************
#define SYSCTL_PPFAN_P0 0x00000001 // FAN Module 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_PPEEPROM_P0 0x00000001 // EEPROM Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_PPWTIMER_P5 \
    0x00000020 // 32/64-Bit Wide General-Purpose
               // Timer 5 Present
#define SYSCTL_PPWTIMER_P4 \
    0x00000010 // 32/64-Bit Wide General-Purpose
               // Timer 4 Present
#define SYSCTL_PPWTIMER_P3 \
    0x00000008 // 32/64-Bit Wide General-Purpose
               // Timer 3 Present
#define SYSCTL_PPWTIMER_P2 \
    0x00000004 // 32/64-Bit Wide General-Purpose
               // Timer 2 Present
#define SYSCTL_PPWTIMER_P1 \
    0x00000002 // 32/64-Bit Wide General-Purpose
               // Timer 1 Present
#define SYSCTL_PPWTIMER_P0 \
    0x00000001 // 32/64-Bit Wide General-Purpose
               // Timer 0 Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPRTS register.
//
//*****************************************************************************
#define SYSCTL_PPRTS_P0 0x00000001 // RTS Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPCCM register.
//
//*****************************************************************************
#define SYSCTL_PPCCM_P0 \
    0x00000001 // CRC and Cryptographic Modules
               // Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPLCD register.
//
//*****************************************************************************
#define SYSCTL_PPLCD_P0 0x00000001 // LCD Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPOWIRE register.
//
//*****************************************************************************
#define SYSCTL_PPOWIRE_P0 0x00000001 // 1-Wire Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPEMAC register.
//
//*****************************************************************************
#define SYSCTL_PPEMAC_P0 \
    0x00000001 // Ethernet Controller Module
               // Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PPHIM register.
//
//*****************************************************************************
#define SYSCTL_PPHIM_P0 0x00000001 // HIM Module Present

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRWD register.
//
//*****************************************************************************
#define SYSCTL_SRWD_R1 0x00000002 // Watchdog Timer 1 Software Reset
#define SYSCTL_SRWD_R0 0x00000001 // Watchdog Timer 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRTIMER register.
//
//*****************************************************************************
#define SYSCTL_SRTIMER_R7 \
    0x00000080 // 16/32-Bit General-Purpose Timer
               // 7 Software Reset
#define SYSCTL_SRTIMER_R6 \
    0x00000040 // 16/32-Bit General-Purpose Timer
               // 6 Software Reset
#define SYSCTL_SRTIMER_R5 \
    0x00000020 // 16/32-Bit General-Purpose Timer
               // 5 Software Reset
#define SYSCTL_SRTIMER_R4 \
    0x00000010 // 16/32-Bit General-Purpose Timer
               // 4 Software Reset
#define SYSCTL_SRTIMER_R3 \
    0x00000008 // 16/32-Bit General-Purpose Timer
               // 3 Software Reset
#define SYSCTL_SRTIMER_R2 \
    0x00000004 // 16/32-Bit General-Purpose Timer
               // 2 Software Reset
#define SYSCTL_SRTIMER_R1 \
    0x00000002 // 16/32-Bit General-Purpose Timer
               // 1 Software Reset
#define SYSCTL_SRTIMER_R0 \
    0x00000001 // 16/32-Bit General-Purpose Timer
               // 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRGPIO register.
//
//*****************************************************************************
#define SYSCTL_SRGPIO_R17 0x00020000 // GPIO Port T Software Reset
#define SYSCTL_SRGPIO_R16 0x00010000 // GPIO Port S Software Reset
#define SYSCTL_SRGPIO_R15 0x00008000 // GPIO Port R Software Reset
#define SYSCTL_SRGPIO_R14 0x00004000 // GPIO Port Q Software Reset
#define SYSCTL_SRGPIO_R13 0x00002000 // GPIO Port P Software Reset
#define SYSCTL_SRGPIO_R12 0x00001000 // GPIO Port N Software Reset
#define SYSCTL_SRGPIO_R11 0x00000800 // GPIO Port M Software Reset
#define SYSCTL_SRGPIO_R10 0x00000400 // GPIO Port L Software Reset
#define SYSCTL_SRGPIO_R9  0x00000200 // GPIO Port K Software Reset
#define SYSCTL_SRGPIO_R8  0x00000100 // GPIO Port J Software Reset
#define SYSCTL_SRGPIO_R7  0x00000080 // GPIO Port H Software Reset
#define SYSCTL_SRGPIO_R6  0x00000040 // GPIO Port G Software Reset
#define SYSCTL_SRGPIO_R5  0x00000020 // GPIO Port F Software Reset
#define SYSCTL_SRGPIO_R4  0x00000010 // GPIO Port E Software Reset
#define SYSCTL_SRGPIO_R3  0x00000008 // GPIO Port D Software Reset
#define SYSCTL_SRGPIO_R2  0x00000004 // GPIO Port C Software Reset
#define SYSCTL_SRGPIO_R1  0x00000002 // GPIO Port B Software Reset
#define SYSCTL_SRGPIO_R0  0x00000001 // GPIO Port A Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRDMA register.
//
//*****************************************************************************
#define SYSCTL_SRDMA_R0 0x00000001 // uDMA Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SREPI register.
//
//*****************************************************************************
#define SYSCTL_SREPI_R0 0x00000001 // EPI Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRHIB register.
//
//*****************************************************************************
#define SYSCTL_SRHIB_R0 \
    0x00000001 // Hibernation Module Software
               // Reset

