fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRUART register.
//
//*****************************************************************************
#define SYSCTL_SRUART_R7 0x00000080 // UART Module 7 Software Reset
#define SYSCTL_SRUART_R6 0x00000040 // UART Module 6 Software Reset
#define SYSCTL_SRUART_R5 0x00000020 // UART Module 5 Software Reset
#define SYSCTL_SRUART_R4 0x00000010 // UART Module 4 Software Reset
#define SYSCTL_SRUART_R3 0x00000008 // UART Module 3 Software Reset
#define SYSCTL_SRUART_R2 0x00000004 // UART Module 2 Software Reset
#define SYSCTL_SRUART_R1 0x00000002 // UART Module 1 Software Reset
#define SYSCTL_SRUART_R0 0x00000001 // UART Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRSSI register.
//
//*****************************************************************************
#define SYSCTL_SRSSI_R3 0x00000008 // SSI Module 3 Software Reset
#define SYSCTL_SRSSI_R2 0x00000004 // SSI Module 2 Software Reset
#define SYSCTL_SRSSI_R1 0x00000002 // SSI Module 1 Software Reset
#define SYSCTL_SRSSI_R0 0x00000001 // SSI Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRI2C register.
//
//*****************************************************************************
#define SYSCTL_SRI2C_R9 0x00000200 // I2C Module 9 Software Reset
#define SYSCTL_SRI2C_R8 0x00000100 // I2C Module 8 Software Reset
#define SYSCTL_SRI2C_R7 0x00000080 // I2C Module 7 Software Reset
#define SYSCTL_SRI2C_R6 0x00000040 // I2C Module 6 Software Reset
#define SYSCTL_SRI2C_R5 0x00000020 // I2C Module 5 Software Reset
#define SYSCTL_SRI2C_R4 0x00000010 // I2C Module 4 Software Reset
#define SYSCTL_SRI2C_R3 0x00000008 // I2C Module 3 Software Reset
#define SYSCTL_SRI2C_R2 0x00000004 // I2C Module 2 Software Reset
#define SYSCTL_SRI2C_R1 0x00000002 // I2C Module 1 Software Reset
#define SYSCTL_SRI2C_R0 0x00000001 // I2C Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRUSB register.
//
//*****************************************************************************
#define SYSCTL_SRUSB_R0 0x00000001 // USB Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SREPHY register.
//
//*****************************************************************************
#define SYSCTL_SREPHY_R0 \
    0x00000001 // Ethernet PHY Module Software
               // Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCAN register.
//
//*****************************************************************************
#define SYSCTL_SRCAN_R1 0x00000002 // CAN Module 1 Software Reset
#define SYSCTL_SRCAN_R0 0x00000001 // CAN Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRADC register.
//
//*****************************************************************************
#define SYSCTL_SRADC_R1 0x00000002 // ADC Module 1 Software Reset
#define SYSCTL_SRADC_R0 0x00000001 // ADC Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRACMP register.
//
//*****************************************************************************
#define SYSCTL_SRACMP_R0 \
    0x00000001 // Analog Comparator Module 0
               // Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRPWM register.
//
//*****************************************************************************
#define SYSCTL_SRPWM_R1 0x00000002 // PWM Module 1 Software Reset
#define SYSCTL_SRPWM_R0 0x00000001 // PWM Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRQEI register.
//
//*****************************************************************************
#define SYSCTL_SRQEI_R1 0x00000002 // QEI Module 1 Software Reset
#define SYSCTL_SRQEI_R0 0x00000001 // QEI Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SREEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_SREEPROM_R0 0x00000001 // EEPROM Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_SRWTIMER_R5 \
    0x00000020 // 32/64-Bit Wide General-Purpose
               // Timer 5 Software Reset
#define SYSCTL_SRWTIMER_R4 \
    0x00000010 // 32/64-Bit Wide General-Purpose
               // Timer 4 Software Reset
#define SYSCTL_SRWTIMER_R3 \
    0x00000008 // 32/64-Bit Wide General-Purpose
               // Timer 3 Software Reset
#define SYSCTL_SRWTIMER_R2 \
    0x00000004 // 32/64-Bit Wide General-Purpose
               // Timer 2 Software Reset
#define SYSCTL_SRWTIMER_R1 \
    0x00000002 // 32/64-Bit Wide General-Purpose
               // Timer 1 Software Reset
#define SYSCTL_SRWTIMER_R0 \
    0x00000001 // 32/64-Bit Wide General-Purpose
               // Timer 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRCCM register.
//
//*****************************************************************************
#define SYSCTL_SRCCM_R0 \
    0x00000001 // CRC and Cryptographic Modules
               // Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SRLCD register.
//
//*****************************************************************************
#define SYSCTL_SRLCD_R0 0x00000001 // LCD Module 0 Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SROWIRE register.
//
//*****************************************************************************
#define SYSCTL_SROWIRE_R0 0x00000001 // 1-Wire Module Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SREMAC register.
//
//*****************************************************************************
#define SYSCTL_SREMAC_R0 \
    0x00000001 // Ethernet Controller MAC Module 0
               // Software Reset

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCWD register.
//
//*****************************************************************************
#define SYSCTL_RCGCWD_R1 \
    0x00000002 // Watchdog Timer 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCWD_R0 \
    0x00000001 // Watchdog Timer 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCTIMER_R7 \
    0x00000080 // 16/32-Bit General-Purpose Timer
               // 7 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R6 \
    0x00000040 // 16/32-Bit General-Purpose Timer
               // 6 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R5 \
    0x00000020 // 16/32-Bit General-Purpose Timer
               // 5 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R4 \
    0x00000010 // 16/32-Bit General-Purpose Timer
               // 4 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R3 \
    0x00000008 // 16/32-Bit General-Purpose Timer
               // 3 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R2 \
    0x00000004 // 16/32-Bit General-Purpose Timer
               // 2 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R1 \
    0x00000002 // 16/32-Bit General-Purpose Timer
               // 1 Run Mode Clock Gating Control
#define SYSCTL_RCGCTIMER_R0 \
    0x00000001 // 16/32-Bit General-Purpose Timer
               // 0 Run Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCGPIO
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCGPIO_R17 \
    0x00020000 // GPIO Port T Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R16 \
    0x00010000 // GPIO Port S Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R15 \
    0x00008000 // GPIO Port R Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R14 \
    0x00004000 // GPIO Port Q Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R13 \
    0x00002000 // GPIO Port P Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R12 \
    0x00001000 // GPIO Port N Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R11 \
    0x00000800 // GPIO Port M Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R10 \
    0x00000400 // GPIO Port L Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R9 \
    0x00000200 // GPIO Port K Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R8 \
    0x00000100 // GPIO Port J Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R7 \
    0x00000080 // GPIO Port H Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R6 \
    0x00000040 // GPIO Port G Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R5 \
    0x00000020 // GPIO Port F Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R4 \
    0x00000010 // GPIO Port E Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R3 \
    0x00000008 // GPIO Port D Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R2 \
    0x00000004 // GPIO Port C Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R1 \
    0x00000002 // GPIO Port B Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCGPIO_R0 \
    0x00000001 // GPIO Port A Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCDMA register.
//
//*****************************************************************************
#define SYSCTL_RCGCDMA_R0 \
    0x00000001 // uDMA Module Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCEPI register.
//
//*****************************************************************************
#define SYSCTL_RCGCEPI_R0 \
    0x00000001 // EPI Module Run Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCHIB register.
//
//*****************************************************************************
#define SYSCTL_RCGCHIB_R0 \
    0x00000001 // Hibernation Module Run Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCUART
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCUART_R7 \
    0x00000080 // UART Module 7 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R6 \
    0x00000040 // UART Module 6 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R5 \
    0x00000020 // UART Module 5 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R4 \
    0x00000010 // UART Module 4 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R3 \
    0x00000008 // UART Module 3 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R2 \
    0x00000004 // UART Module 2 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R1 \
    0x00000002 // UART Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCUART_R0 \
    0x00000001 // UART Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCSSI register.
//
//*****************************************************************************
#define SYSCTL_RCGCSSI_R3 \
    0x00000008 // SSI Module 3 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCSSI_R2 \
    0x00000004 // SSI Module 2 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCSSI_R1 \
    0x00000002 // SSI Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCSSI_R0 \
    0x00000001 // SSI Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCI2C register.
//
//*****************************************************************************
#define SYSCTL_RCGCI2C_R9 \
    0x00000200 // I2C Module 9 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R8 \
    0x00000100 // I2C Module 8 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R7 \
    0x00000080 // I2C Module 7 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R6 \
    0x00000040 // I2C Module 6 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R5 \
    0x00000020 // I2C Module 5 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R4 \
    0x00000010 // I2C Module 4 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R3 \
    0x00000008 // I2C Module 3 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R2 \
    0x00000004 // I2C Module 2 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R1 \
    0x00000002 // I2C Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCI2C_R0 \
    0x00000001 // I2C Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCUSB register.
//
//*****************************************************************************
#define SYSCTL_RCGCUSB_R0 \
    0x00000001 // USB Module Run Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCEPHY
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCEPHY_R0 \
    0x00000001 // Ethernet PHY Module Run Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCCAN register.
//
//*****************************************************************************
#define SYSCTL_RCGCCAN_R1 \
    0x00000002 // CAN Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCCAN_R0 \
    0x00000001 // CAN Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCADC register.
//
//*****************************************************************************
#define SYSCTL_RCGCADC_R1 \
    0x00000002 // ADC Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCADC_R0 \
    0x00000001 // ADC Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCACMP
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCACMP_R0 \
    0x00000001 // Analog Comparator Module 0 Run
               // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCPWM register.
//
//*****************************************************************************
#define SYSCTL_RCGCPWM_R1 \
    0x00000002 // PWM Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCPWM_R0 \
    0x00000001 // PWM Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCQEI register.
//
//*****************************************************************************
#define SYSCTL_RCGCQEI_R1 \
    0x00000002 // QEI Module 1 Run Mode Clock
               // Gating Control
#define SYSCTL_RCGCQEI_R0 \
    0x00000001 // QEI Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCEEPROM_R0 \
    0x00000001 // EEPROM Module Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCWTIMER_R5 \
    0x00000020 // 32/64-Bit Wide General-Purpose
               // Timer 5 Run Mode Clock Gating
               // Control
#define SYSCTL_RCGCWTIMER_R4 \
    0x00000010 // 32/64-Bit Wide General-Purpose
               // Timer 4 Run Mode Clock Gating
               // Control
#define SYSCTL_RCGCWTIMER_R3 \
    0x00000008 // 32/64-Bit Wide General-Purpose
               // Timer 3 Run Mode Clock Gating
               // Control
#define SYSCTL_RCGCWTIMER_R2 \
    0x00000004 // 32/64-Bit Wide General-Purpose
               // Timer 2 Run Mode Clock Gating
               // Control
#define SYSCTL_RCGCWTIMER_R1 \
    0x00000002 // 32/64-Bit Wide General-Purpose
               // Timer 1 Run Mode Clock Gating
               // Control
#define SYSCTL_RCGCWTIMER_R0 \
    0x00000001 // 32/64-Bit Wide General-Purpose
               // Timer 0 Run Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCCCM register.
//
//*****************************************************************************
#define SYSCTL_RCGCCCM_R0 \
    0x00000001 // CRC and Cryptographic Modules
               // Run Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCLCD register.
//
//*****************************************************************************
#define SYSCTL_RCGCLCD_R0 \
    0x00000001 // LCD Controller Module 0 Run Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCOWIRE
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCOWIRE_R0 \
    0x00000001 // 1-Wire Module 0 Run Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_RCGCEMAC
// register.
//
//*****************************************************************************
#define SYSCTL_RCGCEMAC_R0 \
    0x00000001 // Ethernet MAC Module 0 Run Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCWD register.
//
//*****************************************************************************
#define SYSCTL_SCGCWD_S1 \
    0x00000002 // Watchdog Timer 1 Sleep Mode
               // Clock Gating Control
#define SYSCTL_SCGCWD_S0 \
    0x00000001 // Watchdog Timer 0 Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCTIMER_S7 \
    0x00000080 // 16/32-Bit General-Purpose Timer
               // 7 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S6 \
    0x00000040 // 16/32-Bit General-Purpose Timer
               // 6 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S5 \
    0x00000020 // 16/32-Bit General-Purpose Timer
               // 5 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S4 \
    0x00000010 // 16/32-Bit General-Purpose Timer
               // 4 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S3 \
    0x00000008 // 16/32-Bit General-Purpose Timer
               // 3 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S2 \
    0x00000004 // 16/32-Bit General-Purpose Timer
               // 2 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S1 \
    0x00000002 // 16/32-Bit General-Purpose Timer
               // 1 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCTIMER_S0 \
    0x00000001 // 16/32-Bit General-Purpose Timer
               // 0 Sleep Mode Clock Gating
               // Control

