fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCGPIO
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCGPIO_S17 \
    0x00020000 // GPIO Port T Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S16 \
    0x00010000 // GPIO Port S Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S15 \
    0x00008000 // GPIO Port R Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S14 \
    0x00004000 // GPIO Port Q Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S13 \
    0x00002000 // GPIO Port P Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S12 \
    0x00001000 // GPIO Port N Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S11 \
    0x00000800 // GPIO Port M Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S10 \
    0x00000400 // GPIO Port L Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S9 \
    0x00000200 // GPIO Port K Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S8 \
    0x00000100 // GPIO Port J Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S7 \
    0x00000080 // GPIO Port H Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S6 \
    0x00000040 // GPIO Port G Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S5 \
    0x00000020 // GPIO Port F Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S4 \
    0x00000010 // GPIO Port E Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S3 \
    0x00000008 // GPIO Port D Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S2 \
    0x00000004 // GPIO Port C Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S1 \
    0x00000002 // GPIO Port B Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCGPIO_S0 \
    0x00000001 // GPIO Port A Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCDMA register.
//
//*****************************************************************************
#define SYSCTL_SCGCDMA_S0 \
    0x00000001 // uDMA Module Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCEPI register.
//
//*****************************************************************************
#define SYSCTL_SCGCEPI_S0 \
    0x00000001 // EPI Module Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCHIB register.
//
//*****************************************************************************
#define SYSCTL_SCGCHIB_S0 \
    0x00000001 // Hibernation Module Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCUART
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCUART_S7 \
    0x00000080 // UART Module 7 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S6 \
    0x00000040 // UART Module 6 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S5 \
    0x00000020 // UART Module 5 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S4 \
    0x00000010 // UART Module 4 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S3 \
    0x00000008 // UART Module 3 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S2 \
    0x00000004 // UART Module 2 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S1 \
    0x00000002 // UART Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCUART_S0 \
    0x00000001 // UART Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCSSI register.
//
//*****************************************************************************
#define SYSCTL_SCGCSSI_S3 \
    0x00000008 // SSI Module 3 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCSSI_S2 \
    0x00000004 // SSI Module 2 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCSSI_S1 \
    0x00000002 // SSI Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCSSI_S0 \
    0x00000001 // SSI Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCI2C register.
//
//*****************************************************************************
#define SYSCTL_SCGCI2C_S9 \
    0x00000200 // I2C Module 9 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S8 \
    0x00000100 // I2C Module 8 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S7 \
    0x00000080 // I2C Module 7 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S6 \
    0x00000040 // I2C Module 6 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S5 \
    0x00000020 // I2C Module 5 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S4 \
    0x00000010 // I2C Module 4 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S3 \
    0x00000008 // I2C Module 3 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S2 \
    0x00000004 // I2C Module 2 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S1 \
    0x00000002 // I2C Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCI2C_S0 \
    0x00000001 // I2C Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCUSB register.
//
//*****************************************************************************
#define SYSCTL_SCGCUSB_S0 \
    0x00000001 // USB Module Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCEPHY
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCEPHY_S0 \
    0x00000001 // PHY Module Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCCAN register.
//
//*****************************************************************************
#define SYSCTL_SCGCCAN_S1 \
    0x00000002 // CAN Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCCAN_S0 \
    0x00000001 // CAN Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCADC register.
//
//*****************************************************************************
#define SYSCTL_SCGCADC_S1 \
    0x00000002 // ADC Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCADC_S0 \
    0x00000001 // ADC Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCACMP
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCACMP_S0 \
    0x00000001 // Analog Comparator Module 0 Sleep
               // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCPWM register.
//
//*****************************************************************************
#define SYSCTL_SCGCPWM_S1 \
    0x00000002 // PWM Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCPWM_S0 \
    0x00000001 // PWM Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCQEI register.
//
//*****************************************************************************
#define SYSCTL_SCGCQEI_S1 \
    0x00000002 // QEI Module 1 Sleep Mode Clock
               // Gating Control
#define SYSCTL_SCGCQEI_S0 \
    0x00000001 // QEI Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCEEPROM_S0 \
    0x00000001 // EEPROM Module Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCWTIMER_S5 \
    0x00000020 // 32/64-Bit Wide General-Purpose
               // Timer 5 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCWTIMER_S4 \
    0x00000010 // 32/64-Bit Wide General-Purpose
               // Timer 4 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCWTIMER_S3 \
    0x00000008 // 32/64-Bit Wide General-Purpose
               // Timer 3 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCWTIMER_S2 \
    0x00000004 // 32/64-Bit Wide General-Purpose
               // Timer 2 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCWTIMER_S1 \
    0x00000002 // 32/64-Bit Wide General-Purpose
               // Timer 1 Sleep Mode Clock Gating
               // Control
#define SYSCTL_SCGCWTIMER_S0 \
    0x00000001 // 32/64-Bit Wide General-Purpose
               // Timer 0 Sleep Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCCCM register.
//
//*****************************************************************************
#define SYSCTL_SCGCCCM_S0 \
    0x00000001 // CRC and Cryptographic Modules
               // Sleep Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCLCD register.
//
//*****************************************************************************
#define SYSCTL_SCGCLCD_S0 \
    0x00000001 // LCD Controller Module 0 Sleep
               // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCOWIRE
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCOWIRE_S0 \
    0x00000001 // 1-Wire Module 0 Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_SCGCEMAC
// register.
//
//*****************************************************************************
#define SYSCTL_SCGCEMAC_S0 \
    0x00000001 // Ethernet MAC Module 0 Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCWD register.
//
//*****************************************************************************
#define SYSCTL_DCGCWD_D1 \
    0x00000002 // Watchdog Timer 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCWD_D0 \
    0x00000001 // Watchdog Timer 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCTIMER_D7 \
    0x00000080 // 16/32-Bit General-Purpose Timer
               // 7 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D6 \
    0x00000040 // 16/32-Bit General-Purpose Timer
               // 6 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D5 \
    0x00000020 // 16/32-Bit General-Purpose Timer
               // 5 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D4 \
    0x00000010 // 16/32-Bit General-Purpose Timer
               // 4 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D3 \
    0x00000008 // 16/32-Bit General-Purpose Timer
               // 3 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D2 \
    0x00000004 // 16/32-Bit General-Purpose Timer
               // 2 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D1 \
    0x00000002 // 16/32-Bit General-Purpose Timer
               // 1 Deep-Sleep Mode Clock Gating
               // Control
#define SYSCTL_DCGCTIMER_D0 \
    0x00000001 // 16/32-Bit General-Purpose Timer
               // 0 Deep-Sleep Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCGPIO
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCGPIO_D17 \
    0x00020000 // GPIO Port T Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D16 \
    0x00010000 // GPIO Port S Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D15 \
    0x00008000 // GPIO Port R Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D14 \
    0x00004000 // GPIO Port Q Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D13 \
    0x00002000 // GPIO Port P Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D12 \
    0x00001000 // GPIO Port N Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D11 \
    0x00000800 // GPIO Port M Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D10 \
    0x00000400 // GPIO Port L Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D9 \
    0x00000200 // GPIO Port K Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D8 \
    0x00000100 // GPIO Port J Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D7 \
    0x00000080 // GPIO Port H Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D6 \
    0x00000040 // GPIO Port G Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D5 \
    0x00000020 // GPIO Port F Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D4 \
    0x00000010 // GPIO Port E Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D3 \
    0x00000008 // GPIO Port D Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D2 \
    0x00000004 // GPIO Port C Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D1 \
    0x00000002 // GPIO Port B Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCGPIO_D0 \
    0x00000001 // GPIO Port A Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCDMA register.
//
//*****************************************************************************
#define SYSCTL_DCGCDMA_D0 \
    0x00000001 // uDMA Module Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCEPI register.
//
//*****************************************************************************
#define SYSCTL_DCGCEPI_D0 \
    0x00000001 // EPI Module Deep-Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCHIB register.
//
//*****************************************************************************
#define SYSCTL_DCGCHIB_D0 \
    0x00000001 // Hibernation Module Deep-Sleep
               // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCUART
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCUART_D7 \
    0x00000080 // UART Module 7 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D6 \
    0x00000040 // UART Module 6 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D5 \
    0x00000020 // UART Module 5 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D4 \
    0x00000010 // UART Module 4 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D3 \
    0x00000008 // UART Module 3 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D2 \
    0x00000004 // UART Module 2 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D1 \
    0x00000002 // UART Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCUART_D0 \
    0x00000001 // UART Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCSSI register.
//
//*****************************************************************************
#define SYSCTL_DCGCSSI_D3 \
    0x00000008 // SSI Module 3 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCSSI_D2 \
    0x00000004 // SSI Module 2 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCSSI_D1 \
    0x00000002 // SSI Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCSSI_D0 \
    0x00000001 // SSI Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCI2C register.
//
//*****************************************************************************
#define SYSCTL_DCGCI2C_D9 \
    0x00000200 // I2C Module 9 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D8 \
    0x00000100 // I2C Module 8 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D7 \
    0x00000080 // I2C Module 7 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D6 \
    0x00000040 // I2C Module 6 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D5 \
    0x00000020 // I2C Module 5 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D4 \
    0x00000010 // I2C Module 4 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D3 \
    0x00000008 // I2C Module 3 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D2 \
    0x00000004 // I2C Module 2 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D1 \
    0x00000002 // I2C Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCI2C_D0 \
    0x00000001 // I2C Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCUSB register.
//
//*****************************************************************************
#define SYSCTL_DCGCUSB_D0 \
    0x00000001 // USB Module Deep-Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCEPHY
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCEPHY_D0 \
    0x00000001 // PHY Module Deep-Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCCAN register.
//
//*****************************************************************************
#define SYSCTL_DCGCCAN_D1 \
    0x00000002 // CAN Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCCAN_D0 \
    0x00000001 // CAN Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCADC register.
//
//*****************************************************************************
#define SYSCTL_DCGCADC_D1 \
    0x00000002 // ADC Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCADC_D0 \
    0x00000001 // ADC Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCACMP
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCACMP_D0 \
    0x00000001 // Analog Comparator Module 0
               // Deep-Sleep Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCPWM register.
//
//*****************************************************************************
#define SYSCTL_DCGCPWM_D1 \
    0x00000002 // PWM Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCPWM_D0 \
    0x00000001 // PWM Module 0 Deep-Sleep Mode
               // Clock Gating Control

