fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCQEI register.
//
//*****************************************************************************
#define SYSCTL_DCGCQEI_D1 \
    0x00000002 // QEI Module 1 Deep-Sleep Mode
               // Clock Gating Control
#define SYSCTL_DCGCQEI_D0 \
    0x00000001 // QEI Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCEEPROM_D0 \
    0x00000001 // EEPROM Module Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCWTIMER_D5 \
    0x00000020 // 32/64-Bit Wide General-Purpose
               // Timer 5 Deep-Sleep Mode Clock
               // Gating Control
#define SYSCTL_DCGCWTIMER_D4 \
    0x00000010 // 32/64-Bit Wide General-Purpose
               // Timer 4 Deep-Sleep Mode Clock
               // Gating Control
#define SYSCTL_DCGCWTIMER_D3 \
    0x00000008 // 32/64-Bit Wide General-Purpose
               // Timer 3 Deep-Sleep Mode Clock
               // Gating Control
#define SYSCTL_DCGCWTIMER_D2 \
    0x00000004 // 32/64-Bit Wide General-Purpose
               // Timer 2 Deep-Sleep Mode Clock
               // Gating Control
#define SYSCTL_DCGCWTIMER_D1 \
    0x00000002 // 32/64-Bit Wide General-Purpose
               // Timer 1 Deep-Sleep Mode Clock
               // Gating Control
#define SYSCTL_DCGCWTIMER_D0 \
    0x00000001 // 32/64-Bit Wide General-Purpose
               // Timer 0 Deep-Sleep Mode Clock
               // Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCCCM register.
//
//*****************************************************************************
#define SYSCTL_DCGCCCM_D0 \
    0x00000001 // CRC and Cryptographic Modules
               // Deep-Sleep Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCLCD register.
//
//*****************************************************************************
#define SYSCTL_DCGCLCD_D0 \
    0x00000001 // LCD Controller Module 0
               // Deep-Sleep Mode Clock Gating
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCOWIRE
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCOWIRE_D0 \
    0x00000001 // 1-Wire Module 0 Deep-Sleep Mode
               // Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DCGCEMAC
// register.
//
//*****************************************************************************
#define SYSCTL_DCGCEMAC_D0 \
    0x00000001 // Ethernet MAC Module 0 Deep-Sleep
               // Mode Clock Gating Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCWD register.
//
//*****************************************************************************
#define SYSCTL_PCWD_P1 0x00000002 // Watchdog Timer 1 Power Control
#define SYSCTL_PCWD_P0 0x00000001 // Watchdog Timer 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCTIMER register.
//
//*****************************************************************************
#define SYSCTL_PCTIMER_P7 \
    0x00000080 // General-Purpose Timer 7 Power
               // Control
#define SYSCTL_PCTIMER_P6 \
    0x00000040 // General-Purpose Timer 6 Power
               // Control
#define SYSCTL_PCTIMER_P5 \
    0x00000020 // General-Purpose Timer 5 Power
               // Control
#define SYSCTL_PCTIMER_P4 \
    0x00000010 // General-Purpose Timer 4 Power
               // Control
#define SYSCTL_PCTIMER_P3 \
    0x00000008 // General-Purpose Timer 3 Power
               // Control
#define SYSCTL_PCTIMER_P2 \
    0x00000004 // General-Purpose Timer 2 Power
               // Control
#define SYSCTL_PCTIMER_P1 \
    0x00000002 // General-Purpose Timer 1 Power
               // Control
#define SYSCTL_PCTIMER_P0 \
    0x00000001 // General-Purpose Timer 0 Power
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCGPIO register.
//
//*****************************************************************************
#define SYSCTL_PCGPIO_P17 0x00020000 // GPIO Port T Power Control
#define SYSCTL_PCGPIO_P16 0x00010000 // GPIO Port S Power Control
#define SYSCTL_PCGPIO_P15 0x00008000 // GPIO Port R Power Control
#define SYSCTL_PCGPIO_P14 0x00004000 // GPIO Port Q Power Control
#define SYSCTL_PCGPIO_P13 0x00002000 // GPIO Port P Power Control
#define SYSCTL_PCGPIO_P12 0x00001000 // GPIO Port N Power Control
#define SYSCTL_PCGPIO_P11 0x00000800 // GPIO Port M Power Control
#define SYSCTL_PCGPIO_P10 0x00000400 // GPIO Port L Power Control
#define SYSCTL_PCGPIO_P9  0x00000200 // GPIO Port K Power Control
#define SYSCTL_PCGPIO_P8  0x00000100 // GPIO Port J Power Control
#define SYSCTL_PCGPIO_P7  0x00000080 // GPIO Port H Power Control
#define SYSCTL_PCGPIO_P6  0x00000040 // GPIO Port G Power Control
#define SYSCTL_PCGPIO_P5  0x00000020 // GPIO Port F Power Control
#define SYSCTL_PCGPIO_P4  0x00000010 // GPIO Port E Power Control
#define SYSCTL_PCGPIO_P3  0x00000008 // GPIO Port D Power Control
#define SYSCTL_PCGPIO_P2  0x00000004 // GPIO Port C Power Control
#define SYSCTL_PCGPIO_P1  0x00000002 // GPIO Port B Power Control
#define SYSCTL_PCGPIO_P0  0x00000001 // GPIO Port A Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCDMA register.
//
//*****************************************************************************
#define SYSCTL_PCDMA_P0 0x00000001 // uDMA Module Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCEPI register.
//
//*****************************************************************************
#define SYSCTL_PCEPI_P0 0x00000001 // EPI Module Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCHIB register.
//
//*****************************************************************************
#define SYSCTL_PCHIB_P0 0x00000001 // Hibernation Module Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCUART register.
//
//*****************************************************************************
#define SYSCTL_PCUART_P7 0x00000080 // UART Module 7 Power Control
#define SYSCTL_PCUART_P6 0x00000040 // UART Module 6 Power Control
#define SYSCTL_PCUART_P5 0x00000020 // UART Module 5 Power Control
#define SYSCTL_PCUART_P4 0x00000010 // UART Module 4 Power Control
#define SYSCTL_PCUART_P3 0x00000008 // UART Module 3 Power Control
#define SYSCTL_PCUART_P2 0x00000004 // UART Module 2 Power Control
#define SYSCTL_PCUART_P1 0x00000002 // UART Module 1 Power Control
#define SYSCTL_PCUART_P0 0x00000001 // UART Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCSSI register.
//
//*****************************************************************************
#define SYSCTL_PCSSI_P3 0x00000008 // SSI Module 3 Power Control
#define SYSCTL_PCSSI_P2 0x00000004 // SSI Module 2 Power Control
#define SYSCTL_PCSSI_P1 0x00000002 // SSI Module 1 Power Control
#define SYSCTL_PCSSI_P0 0x00000001 // SSI Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCI2C register.
//
//*****************************************************************************
#define SYSCTL_PCI2C_P9 0x00000200 // I2C Module 9 Power Control
#define SYSCTL_PCI2C_P8 0x00000100 // I2C Module 8 Power Control
#define SYSCTL_PCI2C_P7 0x00000080 // I2C Module 7 Power Control
#define SYSCTL_PCI2C_P6 0x00000040 // I2C Module 6 Power Control
#define SYSCTL_PCI2C_P5 0x00000020 // I2C Module 5 Power Control
#define SYSCTL_PCI2C_P4 0x00000010 // I2C Module 4 Power Control
#define SYSCTL_PCI2C_P3 0x00000008 // I2C Module 3 Power Control
#define SYSCTL_PCI2C_P2 0x00000004 // I2C Module 2 Power Control
#define SYSCTL_PCI2C_P1 0x00000002 // I2C Module 1 Power Control
#define SYSCTL_PCI2C_P0 0x00000001 // I2C Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCUSB register.
//
//*****************************************************************************
#define SYSCTL_PCUSB_P0 0x00000001 // USB Module Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCEPHY register.
//
//*****************************************************************************
#define SYSCTL_PCEPHY_P0 \
    0x00000001 // Ethernet PHY Module Power
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCCAN register.
//
//*****************************************************************************
#define SYSCTL_PCCAN_P1 0x00000002 // CAN Module 1 Power Control
#define SYSCTL_PCCAN_P0 0x00000001 // CAN Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCADC register.
//
//*****************************************************************************
#define SYSCTL_PCADC_P1 0x00000002 // ADC Module 1 Power Control
#define SYSCTL_PCADC_P0 0x00000001 // ADC Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCACMP register.
//
//*****************************************************************************
#define SYSCTL_PCACMP_P0 \
    0x00000001 // Analog Comparator Module 0 Power
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCPWM register.
//
//*****************************************************************************
#define SYSCTL_PCPWM_P0 0x00000001 // PWM Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCQEI register.
//
//*****************************************************************************
#define SYSCTL_PCQEI_P0 0x00000001 // QEI Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCEEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_PCEEPROM_P0 0x00000001 // EEPROM Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCCCM register.
//
//*****************************************************************************
#define SYSCTL_PCCCM_P0 \
    0x00000001 // CRC and Cryptographic Modules
               // Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCLCD register.
//
//*****************************************************************************
#define SYSCTL_PCLCD_P0 \
    0x00000001 // LCD Controller Module 0 Power
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCOWIRE register.
//
//*****************************************************************************
#define SYSCTL_PCOWIRE_P0 0x00000001 // 1-Wire Module 0 Power Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PCEMAC register.
//
//*****************************************************************************
#define SYSCTL_PCEMAC_P0 \
    0x00000001 // Ethernet MAC Module 0 Power
               // Control

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRWD register.
//
//*****************************************************************************
#define SYSCTL_PRWD_R1 \
    0x00000002 // Watchdog Timer 1 Peripheral
               // Ready
#define SYSCTL_PRWD_R0 \
    0x00000001 // Watchdog Timer 0 Peripheral
               // Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRTIMER register.
//
//*****************************************************************************
#define SYSCTL_PRTIMER_R7 \
    0x00000080 // 16/32-Bit General-Purpose Timer
               // 7 Peripheral Ready
#define SYSCTL_PRTIMER_R6 \
    0x00000040 // 16/32-Bit General-Purpose Timer
               // 6 Peripheral Ready
#define SYSCTL_PRTIMER_R5 \
    0x00000020 // 16/32-Bit General-Purpose Timer
               // 5 Peripheral Ready
#define SYSCTL_PRTIMER_R4 \
    0x00000010 // 16/32-Bit General-Purpose Timer
               // 4 Peripheral Ready
#define SYSCTL_PRTIMER_R3 \
    0x00000008 // 16/32-Bit General-Purpose Timer
               // 3 Peripheral Ready
#define SYSCTL_PRTIMER_R2 \
    0x00000004 // 16/32-Bit General-Purpose Timer
               // 2 Peripheral Ready
#define SYSCTL_PRTIMER_R1 \
    0x00000002 // 16/32-Bit General-Purpose Timer
               // 1 Peripheral Ready
#define SYSCTL_PRTIMER_R0 \
    0x00000001 // 16/32-Bit General-Purpose Timer
               // 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRGPIO register.
//
//*****************************************************************************
#define SYSCTL_PRGPIO_R17 0x00020000 // GPIO Port T Peripheral Ready
#define SYSCTL_PRGPIO_R16 0x00010000 // GPIO Port S Peripheral Ready
#define SYSCTL_PRGPIO_R15 0x00008000 // GPIO Port R Peripheral Ready
#define SYSCTL_PRGPIO_R14 0x00004000 // GPIO Port Q Peripheral Ready
#define SYSCTL_PRGPIO_R13 0x00002000 // GPIO Port P Peripheral Ready
#define SYSCTL_PRGPIO_R12 0x00001000 // GPIO Port N Peripheral Ready
#define SYSCTL_PRGPIO_R11 0x00000800 // GPIO Port M Peripheral Ready
#define SYSCTL_PRGPIO_R10 0x00000400 // GPIO Port L Peripheral Ready
#define SYSCTL_PRGPIO_R9  0x00000200 // GPIO Port K Peripheral Ready
#define SYSCTL_PRGPIO_R8  0x00000100 // GPIO Port J Peripheral Ready
#define SYSCTL_PRGPIO_R7  0x00000080 // GPIO Port H Peripheral Ready
#define SYSCTL_PRGPIO_R6  0x00000040 // GPIO Port G Peripheral Ready
#define SYSCTL_PRGPIO_R5  0x00000020 // GPIO Port F Peripheral Ready
#define SYSCTL_PRGPIO_R4  0x00000010 // GPIO Port E Peripheral Ready
#define SYSCTL_PRGPIO_R3  0x00000008 // GPIO Port D Peripheral Ready
#define SYSCTL_PRGPIO_R2  0x00000004 // GPIO Port C Peripheral Ready
#define SYSCTL_PRGPIO_R1  0x00000002 // GPIO Port B Peripheral Ready
#define SYSCTL_PRGPIO_R0  0x00000001 // GPIO Port A Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRDMA register.
//
//*****************************************************************************
#define SYSCTL_PRDMA_R0 0x00000001 // uDMA Module Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PREPI register.
//
//*****************************************************************************
#define SYSCTL_PREPI_R0 0x00000001 // EPI Module Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRHIB register.
//
//*****************************************************************************
#define SYSCTL_PRHIB_R0 \
    0x00000001 // Hibernation Module Peripheral
               // Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRUART register.
//
//*****************************************************************************
#define SYSCTL_PRUART_R7 0x00000080 // UART Module 7 Peripheral Ready
#define SYSCTL_PRUART_R6 0x00000040 // UART Module 6 Peripheral Ready
#define SYSCTL_PRUART_R5 0x00000020 // UART Module 5 Peripheral Ready
#define SYSCTL_PRUART_R4 0x00000010 // UART Module 4 Peripheral Ready
#define SYSCTL_PRUART_R3 0x00000008 // UART Module 3 Peripheral Ready
#define SYSCTL_PRUART_R2 0x00000004 // UART Module 2 Peripheral Ready
#define SYSCTL_PRUART_R1 0x00000002 // UART Module 1 Peripheral Ready
#define SYSCTL_PRUART_R0 0x00000001 // UART Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRSSI register.
//
//*****************************************************************************
#define SYSCTL_PRSSI_R3 0x00000008 // SSI Module 3 Peripheral Ready
#define SYSCTL_PRSSI_R2 0x00000004 // SSI Module 2 Peripheral Ready
#define SYSCTL_PRSSI_R1 0x00000002 // SSI Module 1 Peripheral Ready
#define SYSCTL_PRSSI_R0 0x00000001 // SSI Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRI2C register.
//
//*****************************************************************************
#define SYSCTL_PRI2C_R9 0x00000200 // I2C Module 9 Peripheral Ready
#define SYSCTL_PRI2C_R8 0x00000100 // I2C Module 8 Peripheral Ready
#define SYSCTL_PRI2C_R7 0x00000080 // I2C Module 7 Peripheral Ready
#define SYSCTL_PRI2C_R6 0x00000040 // I2C Module 6 Peripheral Ready
#define SYSCTL_PRI2C_R5 0x00000020 // I2C Module 5 Peripheral Ready
#define SYSCTL_PRI2C_R4 0x00000010 // I2C Module 4 Peripheral Ready
#define SYSCTL_PRI2C_R3 0x00000008 // I2C Module 3 Peripheral Ready
#define SYSCTL_PRI2C_R2 0x00000004 // I2C Module 2 Peripheral Ready
#define SYSCTL_PRI2C_R1 0x00000002 // I2C Module 1 Peripheral Ready
#define SYSCTL_PRI2C_R0 0x00000001 // I2C Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRUSB register.
//
//*****************************************************************************
#define SYSCTL_PRUSB_R0 0x00000001 // USB Module Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PREPHY register.
//
//*****************************************************************************
#define SYSCTL_PREPHY_R0 \
    0x00000001 // Ethernet PHY Module Peripheral
               // Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRCAN register.
//
//*****************************************************************************
#define SYSCTL_PRCAN_R1 0x00000002 // CAN Module 1 Peripheral Ready
#define SYSCTL_PRCAN_R0 0x00000001 // CAN Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRADC register.
//
//*****************************************************************************
#define SYSCTL_PRADC_R1 0x00000002 // ADC Module 1 Peripheral Ready
#define SYSCTL_PRADC_R0 0x00000001 // ADC Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRACMP register.
//
//*****************************************************************************
#define SYSCTL_PRACMP_R0 \
    0x00000001 // Analog Comparator Module 0
               // Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRPWM register.
//
//*****************************************************************************
#define SYSCTL_PRPWM_R1 0x00000002 // PWM Module 1 Peripheral Ready
#define SYSCTL_PRPWM_R0 0x00000001 // PWM Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRQEI register.
//
//*****************************************************************************
#define SYSCTL_PRQEI_R1 0x00000002 // QEI Module 1 Peripheral Ready
#define SYSCTL_PRQEI_R0 0x00000001 // QEI Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PREEPROM
// register.
//
//*****************************************************************************
#define SYSCTL_PREEPROM_R0 0x00000001 // EEPROM Module Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRWTIMER
// register.
//
//*****************************************************************************
#define SYSCTL_PRWTIMER_R5 \
    0x00000020 // 32/64-Bit Wide General-Purpose
               // Timer 5 Peripheral Ready
#define SYSCTL_PRWTIMER_R4 \
    0x00000010 // 32/64-Bit Wide General-Purpose
               // Timer 4 Peripheral Ready
#define SYSCTL_PRWTIMER_R3 \
    0x00000008 // 32/64-Bit Wide General-Purpose
               // Timer 3 Peripheral Ready
#define SYSCTL_PRWTIMER_R2 \
    0x00000004 // 32/64-Bit Wide General-Purpose
               // Timer 2 Peripheral Ready
#define SYSCTL_PRWTIMER_R1 \
    0x00000002 // 32/64-Bit Wide General-Purpose
               // Timer 1 Peripheral Ready
#define SYSCTL_PRWTIMER_R0 \
    0x00000001 // 32/64-Bit Wide General-Purpose
               // Timer 0 Peripheral Ready

