fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRCCM register.
//
//*****************************************************************************
#define SYSCTL_PRCCM_R0 \
    0x00000001 // CRC and Cryptographic Modules
               // Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PRLCD register.
//
//*****************************************************************************
#define SYSCTL_PRLCD_R0 \
    0x00000001 // LCD Controller Module 0
               // Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PROWIRE register.
//
//*****************************************************************************
#define SYSCTL_PROWIRE_R0 0x00000001 // 1-Wire Module 0 Peripheral Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PREMAC register.
//
//*****************************************************************************
#define SYSCTL_PREMAC_R0 \
    0x00000001 // Ethernet MAC Module 0 Peripheral
               // Ready

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_UNIQUEID0
// register.
//
//*****************************************************************************
#define SYSCTL_UNIQUEID0_ID_M 0xFFFFFFFF // Unique ID
#define SYSCTL_UNIQUEID0_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_UNIQUEID1
// register.
//
//*****************************************************************************
#define SYSCTL_UNIQUEID1_ID_M 0xFFFFFFFF // Unique ID
#define SYSCTL_UNIQUEID1_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_UNIQUEID2
// register.
//
//*****************************************************************************
#define SYSCTL_UNIQUEID2_ID_M 0xFFFFFFFF // Unique ID
#define SYSCTL_UNIQUEID2_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_UNIQUEID3
// register.
//
//*****************************************************************************
#define SYSCTL_UNIQUEID3_ID_M 0xFFFFFFFF // Unique ID
#define SYSCTL_UNIQUEID3_ID_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_CCMCGREQ
// register.
//
//*****************************************************************************
#define SYSCTL_CCMCGREQ_DESCFG 0x00000004 // DES Clock Gating Request
#define SYSCTL_CCMCGREQ_AESCFG 0x00000002 // AES Clock Gating Request
#define SYSCTL_CCMCGREQ_SHACFG 0x00000001 // SHA/MD5 Clock Gating Request

//*****************************************************************************
//
// The following definitions are deprecated.
//
//*****************************************************************************
#ifndef DEPRECATED

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DID0
// register.
//
//*****************************************************************************
#define SYSCTL_DID0_CLASS_BLIZZARD \
    0x00050000 // Tiva(TM) C Series TM4C123-class
               // microcontrollers
#define SYSCTL_DID0_CLASS_SNOWFLAKE \
    0x000A0000 // Tiva(TM) C Series TM4C129-class
               // microcontrollers

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_RESC
// register.
//
//*****************************************************************************
#define SYSCTL_RESC_HIB 0x00000040 // HIB Reset

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_PWRTC
// register.
//
//*****************************************************************************
#define SYSCTL_PWRTC_VDDA_UBOR0 0x00000010 // VDDA Under BOR0 Status
#define SYSCTL_PWRTC_VDD_UBOR0  0x00000001 // VDD Under BOR0 Status

#endif

#endif // __HW_SYSCTL_H__
